--
-- PostgreSQL database dump
--

-- Dumped from database version 17rc1
-- Dumped by pg_dump version 17rc1

-- Started on 2026-05-18 23:36:42

SET statement_timeout = 0;
SET lock_timeout = 0;
SET idle_in_transaction_session_timeout = 0;
SET transaction_timeout = 0;
SET client_encoding = 'UTF8';
SET standard_conforming_strings = on;
SELECT pg_catalog.set_config('search_path', '', false);
SET check_function_bodies = false;
SET xmloption = content;
SET client_min_messages = warning;
SET row_security = off;

--
-- TOC entry 2 (class 3079 OID 49537)
-- Name: cube; Type: EXTENSION; Schema: -; Owner: -
--

CREATE EXTENSION IF NOT EXISTS cube WITH SCHEMA public;


--
-- TOC entry 5009 (class 0 OID 0)
-- Dependencies: 2
-- Name: EXTENSION cube; Type: COMMENT; Schema: -; Owner: 
--

COMMENT ON EXTENSION cube IS 'data type for multidimensional cubes';


--
-- TOC entry 3 (class 3079 OID 49626)
-- Name: earthdistance; Type: EXTENSION; Schema: -; Owner: -
--

CREATE EXTENSION IF NOT EXISTS earthdistance WITH SCHEMA public;


--
-- TOC entry 5010 (class 0 OID 0)
-- Dependencies: 3
-- Name: EXTENSION earthdistance; Type: COMMENT; Schema: -; Owner: 
--

COMMENT ON EXTENSION earthdistance IS 'calculate great-circle distances on the surface of the Earth';


--
-- TOC entry 933 (class 1247 OID 49470)
-- Name: GENDER; Type: TYPE; Schema: public; Owner: postgres
--

CREATE TYPE public."GENDER" AS ENUM (
    'MALE',
    'FEMALE'
);


ALTER TYPE public."GENDER" OWNER TO postgres;

--
-- TOC entry 936 (class 1247 OID 49476)
-- Name: SWIPE; Type: TYPE; Schema: public; Owner: postgres
--

CREATE TYPE public."SWIPE" AS ENUM (
    'LIKE',
    'DISLIKE'
);


ALTER TYPE public."SWIPE" OWNER TO postgres;

SET default_tablespace = '';

SET default_table_access_method = heap;

--
-- TOC entry 234 (class 1259 OID 49494)
-- Name: city; Type: TABLE; Schema: public; Owner: postgres
--

CREATE TABLE public.city (
    id integer NOT NULL,
    city character varying(255) NOT NULL,
    region character varying(255) NOT NULL,
    latitude numeric NOT NULL,
    longitude numeric NOT NULL,
    earth_point point
);


ALTER TABLE public.city OWNER TO postgres;

--
-- TOC entry 233 (class 1259 OID 49493)
-- Name: city_id_seq; Type: SEQUENCE; Schema: public; Owner: postgres
--

CREATE SEQUENCE public.city_id_seq
    AS integer
    START WITH 1
    INCREMENT BY 1
    NO MINVALUE
    NO MAXVALUE
    CACHE 1;


ALTER SEQUENCE public.city_id_seq OWNER TO postgres;

--
-- TOC entry 5011 (class 0 OID 0)
-- Dependencies: 233
-- Name: city_id_seq; Type: SEQUENCE OWNED BY; Schema: public; Owner: postgres
--

ALTER SEQUENCE public.city_id_seq OWNED BY public.city.id;


--
-- TOC entry 226 (class 1259 OID 49366)
-- Name: matches; Type: TABLE; Schema: public; Owner: postgres
--

CREATE TABLE public.matches (
    id bigint NOT NULL,
    user1_id bigint NOT NULL,
    user2_id bigint NOT NULL,
    matched_at timestamp with time zone DEFAULT now() NOT NULL,
    CONSTRAINT matches_check CHECK ((user1_id < user2_id))
);


ALTER TABLE public.matches OWNER TO postgres;

--
-- TOC entry 225 (class 1259 OID 49365)
-- Name: matches_id_seq; Type: SEQUENCE; Schema: public; Owner: postgres
--

CREATE SEQUENCE public.matches_id_seq
    START WITH 1
    INCREMENT BY 1
    NO MINVALUE
    NO MAXVALUE
    CACHE 1;


ALTER SEQUENCE public.matches_id_seq OWNER TO postgres;

--
-- TOC entry 5012 (class 0 OID 0)
-- Dependencies: 225
-- Name: matches_id_seq; Type: SEQUENCE OWNED BY; Schema: public; Owner: postgres
--

ALTER SEQUENCE public.matches_id_seq OWNED BY public.matches.id;


--
-- TOC entry 228 (class 1259 OID 49387)
-- Name: messages; Type: TABLE; Schema: public; Owner: postgres
--

CREATE TABLE public.messages (
    id bigint NOT NULL,
    match_id bigint NOT NULL,
    sender_id bigint NOT NULL,
    content character varying(255) NOT NULL,
    sent_at timestamp with time zone DEFAULT now()
);


ALTER TABLE public.messages OWNER TO postgres;

--
-- TOC entry 227 (class 1259 OID 49386)
-- Name: messages_id_seq; Type: SEQUENCE; Schema: public; Owner: postgres
--

CREATE SEQUENCE public.messages_id_seq
    START WITH 1
    INCREMENT BY 1
    NO MINVALUE
    NO MAXVALUE
    CACHE 1;


ALTER SEQUENCE public.messages_id_seq OWNER TO postgres;

--
-- TOC entry 5013 (class 0 OID 0)
-- Dependencies: 227
-- Name: messages_id_seq; Type: SEQUENCE OWNED BY; Schema: public; Owner: postgres
--

ALTER SEQUENCE public.messages_id_seq OWNED BY public.messages.id;


--
-- TOC entry 230 (class 1259 OID 49407)
-- Name: user_blocks; Type: TABLE; Schema: public; Owner: postgres
--

CREATE TABLE public.user_blocks (
    id bigint NOT NULL,
    blocker_id bigint NOT NULL,
    blocked_id bigint NOT NULL,
    blocked_at timestamp with time zone DEFAULT now() NOT NULL
);


ALTER TABLE public.user_blocks OWNER TO postgres;

--
-- TOC entry 229 (class 1259 OID 49406)
-- Name: user_blocks_id_seq; Type: SEQUENCE; Schema: public; Owner: postgres
--

CREATE SEQUENCE public.user_blocks_id_seq
    START WITH 1
    INCREMENT BY 1
    NO MINVALUE
    NO MAXVALUE
    CACHE 1;


ALTER SEQUENCE public.user_blocks_id_seq OWNER TO postgres;

--
-- TOC entry 5014 (class 0 OID 0)
-- Dependencies: 229
-- Name: user_blocks_id_seq; Type: SEQUENCE OWNED BY; Schema: public; Owner: postgres
--

ALTER SEQUENCE public.user_blocks_id_seq OWNED BY public.user_blocks.id;


--
-- TOC entry 220 (class 1259 OID 49313)
-- Name: user_data; Type: TABLE; Schema: public; Owner: postgres
--

CREATE TABLE public.user_data (
    id bigint NOT NULL,
    email character varying(255) NOT NULL,
    password_hash character varying(255) NOT NULL,
    name character varying(100) NOT NULL,
    date_of_birth date NOT NULL,
    description text DEFAULT ''::text NOT NULL,
    active_video_id bigint,
    is_hidden boolean DEFAULT false NOT NULL,
    created_at timestamp with time zone DEFAULT now() NOT NULL,
    updated_at timestamp with time zone DEFAULT now() NOT NULL,
    gender public."GENDER" NOT NULL,
    city_id integer NOT NULL,
    min_age integer DEFAULT 18,
    max_age integer DEFAULT 99,
    radius_km integer DEFAULT 50,
    preferred_gender text
);


ALTER TABLE public.user_data OWNER TO postgres;

--
-- TOC entry 219 (class 1259 OID 49312)
-- Name: user_data_id_seq; Type: SEQUENCE; Schema: public; Owner: postgres
--

CREATE SEQUENCE public.user_data_id_seq
    START WITH 1
    INCREMENT BY 1
    NO MINVALUE
    NO MAXVALUE
    CACHE 1;


ALTER SEQUENCE public.user_data_id_seq OWNER TO postgres;

--
-- TOC entry 5015 (class 0 OID 0)
-- Dependencies: 219
-- Name: user_data_id_seq; Type: SEQUENCE OWNED BY; Schema: public; Owner: postgres
--

ALTER SEQUENCE public.user_data_id_seq OWNED BY public.user_data.id;


--
-- TOC entry 232 (class 1259 OID 49427)
-- Name: user_reports; Type: TABLE; Schema: public; Owner: postgres
--

CREATE TABLE public.user_reports (
    id bigint NOT NULL,
    reporter_id bigint NOT NULL,
    reported_id bigint NOT NULL,
    reason character varying(255) NOT NULL,
    created_at timestamp with time zone DEFAULT now() NOT NULL
);


ALTER TABLE public.user_reports OWNER TO postgres;

--
-- TOC entry 231 (class 1259 OID 49426)
-- Name: user_reports_id_seq; Type: SEQUENCE; Schema: public; Owner: postgres
--

CREATE SEQUENCE public.user_reports_id_seq
    START WITH 1
    INCREMENT BY 1
    NO MINVALUE
    NO MAXVALUE
    CACHE 1;


ALTER SEQUENCE public.user_reports_id_seq OWNER TO postgres;

--
-- TOC entry 5016 (class 0 OID 0)
-- Dependencies: 231
-- Name: user_reports_id_seq; Type: SEQUENCE OWNED BY; Schema: public; Owner: postgres
--

ALTER SEQUENCE public.user_reports_id_seq OWNED BY public.user_reports.id;


--
-- TOC entry 224 (class 1259 OID 49345)
-- Name: user_swipes; Type: TABLE; Schema: public; Owner: postgres
--

CREATE TABLE public.user_swipes (
    id bigint NOT NULL,
    swiper_id bigint NOT NULL,
    target_id bigint NOT NULL,
    swiped_at timestamp with time zone DEFAULT now() NOT NULL,
    direction public."SWIPE" NOT NULL
);


ALTER TABLE public.user_swipes OWNER TO postgres;

--
-- TOC entry 223 (class 1259 OID 49344)
-- Name: user_swipes_id_seq; Type: SEQUENCE; Schema: public; Owner: postgres
--

CREATE SEQUENCE public.user_swipes_id_seq
    START WITH 1
    INCREMENT BY 1
    NO MINVALUE
    NO MAXVALUE
    CACHE 1;


ALTER SEQUENCE public.user_swipes_id_seq OWNER TO postgres;

--
-- TOC entry 5017 (class 0 OID 0)
-- Dependencies: 223
-- Name: user_swipes_id_seq; Type: SEQUENCE OWNED BY; Schema: public; Owner: postgres
--

ALTER SEQUENCE public.user_swipes_id_seq OWNED BY public.user_swipes.id;


--
-- TOC entry 222 (class 1259 OID 49327)
-- Name: user_videos; Type: TABLE; Schema: public; Owner: postgres
--

CREATE TABLE public.user_videos (
    id bigint NOT NULL,
    user_id bigint NOT NULL,
    video_url character varying(255) NOT NULL,
    thumbnail_url character varying(255) NOT NULL,
    duration_sec integer NOT NULL,
    is_active boolean DEFAULT false NOT NULL,
    views_count integer DEFAULT 0 NOT NULL,
    likes_count integer DEFAULT 0 NOT NULL,
    created_at timestamp with time zone DEFAULT now() NOT NULL
);


ALTER TABLE public.user_videos OWNER TO postgres;

--
-- TOC entry 221 (class 1259 OID 49326)
-- Name: user_videos_id_seq; Type: SEQUENCE; Schema: public; Owner: postgres
--

CREATE SEQUENCE public.user_videos_id_seq
    START WITH 1
    INCREMENT BY 1
    NO MINVALUE
    NO MAXVALUE
    CACHE 1;


ALTER SEQUENCE public.user_videos_id_seq OWNER TO postgres;

--
-- TOC entry 5018 (class 0 OID 0)
-- Dependencies: 221
-- Name: user_videos_id_seq; Type: SEQUENCE OWNED BY; Schema: public; Owner: postgres
--

ALTER SEQUENCE public.user_videos_id_seq OWNED BY public.user_videos.id;


--
-- TOC entry 4779 (class 2604 OID 49497)
-- Name: city id; Type: DEFAULT; Schema: public; Owner: postgres
--

ALTER TABLE ONLY public.city ALTER COLUMN id SET DEFAULT nextval('public.city_id_seq'::regclass);


--
-- TOC entry 4771 (class 2604 OID 49369)
-- Name: matches id; Type: DEFAULT; Schema: public; Owner: postgres
--

ALTER TABLE ONLY public.matches ALTER COLUMN id SET DEFAULT nextval('public.matches_id_seq'::regclass);


--
-- TOC entry 4773 (class 2604 OID 49390)
-- Name: messages id; Type: DEFAULT; Schema: public; Owner: postgres
--

ALTER TABLE ONLY public.messages ALTER COLUMN id SET DEFAULT nextval('public.messages_id_seq'::regclass);


--
-- TOC entry 4775 (class 2604 OID 49410)
-- Name: user_blocks id; Type: DEFAULT; Schema: public; Owner: postgres
--

ALTER TABLE ONLY public.user_blocks ALTER COLUMN id SET DEFAULT nextval('public.user_blocks_id_seq'::regclass);


--
-- TOC entry 4756 (class 2604 OID 49316)
-- Name: user_data id; Type: DEFAULT; Schema: public; Owner: postgres
--

ALTER TABLE ONLY public.user_data ALTER COLUMN id SET DEFAULT nextval('public.user_data_id_seq'::regclass);


--
-- TOC entry 4777 (class 2604 OID 49430)
-- Name: user_reports id; Type: DEFAULT; Schema: public; Owner: postgres
--

ALTER TABLE ONLY public.user_reports ALTER COLUMN id SET DEFAULT nextval('public.user_reports_id_seq'::regclass);


--
-- TOC entry 4769 (class 2604 OID 49348)
-- Name: user_swipes id; Type: DEFAULT; Schema: public; Owner: postgres
--

ALTER TABLE ONLY public.user_swipes ALTER COLUMN id SET DEFAULT nextval('public.user_swipes_id_seq'::regclass);


--
-- TOC entry 4764 (class 2604 OID 49330)
-- Name: user_videos id; Type: DEFAULT; Schema: public; Owner: postgres
--

ALTER TABLE ONLY public.user_videos ALTER COLUMN id SET DEFAULT nextval('public.user_videos_id_seq'::regclass);


--
-- TOC entry 5003 (class 0 OID 49494)
-- Dependencies: 234
-- Data for Name: city; Type: TABLE DATA; Schema: public; Owner: postgres
--

COPY public.city (id, city, region, latitude, longitude, earth_point) FROM stdin;
1	Адыгейск	Адыгея	44.878414	39.190289	(39.190289,44.878414)
2	Майкоп	Адыгея	44.6098268	40.1006606	(40.1006606,44.6098268)
3	Горно-Алтайск	Алтай	51.9581028	85.9603235	(85.9603235,51.9581028)
4	Алейск	Алтайский	52.4922513	82.7793606	(82.7793606,52.4922513)
5	Барнаул	Алтайский	53.3479968	83.7798064	(83.7798064,53.3479968)
6	Белокуриха	Алтайский	51.996152	84.9839604	(84.9839604,51.996152)
7	Бийск	Алтайский	52.5393864	85.2138453	(85.2138453,52.5393864)
8	Горняк	Алтайский	50.9979622	81.4643358	(81.4643358,50.9979622)
9	Заринск	Алтайский	53.7063476	84.9315081	(84.9315081,53.7063476)
10	Змеиногорск	Алтайский	51.1581094	82.1872547	(82.1872547,51.1581094)
11	Камень-на-Оби	Алтайский	53.7913974	81.3545053	(81.3545053,53.7913974)
12	Новоалтайск	Алтайский	53.4119759	83.9311069	(83.9311069,53.4119759)
13	Рубцовск	Алтайский	51.5012067	81.2078695	(81.2078695,51.5012067)
14	Славгород	Алтайский	52.999463	78.6459232	(78.6459232,52.999463)
15	Яровое	Алтайский	52.9252146	78.5729775	(78.5729775,52.9252146)
16	Белогорск	Амурская	50.9213415	128.4739471	(128.4739471,50.9213415)
17	Благовещенск	Амурская	50.290659	127.527198	(127.527198,50.290659)
18	Завитинск	Амурская	50.1064111	129.4391813	(129.4391813,50.1064111)
19	Зея	Амурская	53.7340088	127.265787	(127.265787,53.7340088)
20	Райчихинск	Амурская	49.7941615	129.4112492	(129.4112492,49.7941615)
21	Свободный	Амурская	51.3614103	128.1219729	(128.1219729,51.3614103)
22	Сковородино	Амурская	53.9871095	123.9437205	(123.9437205,53.9871095)
23	Тында	Амурская	55.1546441	124.7468904	(124.7468904,55.1546441)
24	Циолковский	Амурская	51.762481	128.1219846	(128.1219846,51.762481)
25	Шимановск	Амурская	52.0051886	127.7005458	(127.7005458,52.0051886)
26	Архангельск	Архангельская	64.5394289	40.5169606	(40.5169606,64.5394289)
27	Вельск	Архангельская	61.066	42.1032789	(42.1032789,61.066)
28	Каргополь	Архангельская	61.5009724	38.9636966	(38.9636966,61.5009724)
29	Коряжма	Архангельская	61.2885948	47.1003015	(47.1003015,61.2885948)
30	Котлас	Архангельская	61.2528972	46.633242	(46.633242,61.2528972)
31	Мезень	Архангельская	65.8398078	44.2532273	(44.2532273,65.8398078)
32	Мирный	Архангельская	62.7645265	40.3360076	(40.3360076,62.7645265)
33	Новодвинск	Архангельская	64.4136851	40.8208143	(40.8208143,64.4136851)
34	Няндома	Архангельская	61.6654674	40.2062947	(40.2062947,61.6654674)
35	Онега	Архангельская	63.9162928	38.0805031	(38.0805031,63.9162928)
36	Северодвинск	Архангельская	64.5625385	39.8180934	(39.8180934,64.5625385)
37	Сольвычегодск	Архангельская	61.3319616	46.920441	(46.920441,61.3319616)
38	Шенкурск	Архангельская	62.1057272	42.8996973	(42.8996973,62.1057272)
39	Астрахань	Астраханская	46.3655652	48.0559236	(48.0559236,46.3655652)
40	Ахтубинск	Астраханская	48.2752034	46.1906462	(46.1906462,48.2752034)
41	Знаменск	Астраханская	48.5866291	45.7368019	(45.7368019,48.5866291)
42	Камызяк	Астраханская	46.110579	48.07333	(48.07333,46.110579)
43	Нариманов	Астраханская	46.6916565	47.8502476	(47.8502476,46.6916565)
44	Харабали	Астраханская	47.408999	47.2525345	(47.2525345,47.408999)
45	Агидель	Башкортостан	55.8999056	53.9220144	(53.9220144,55.8999056)
46	Баймак	Башкортостан	52.5912896	58.3110998	(58.3110998,52.5912896)
47	Белебей	Башкортостан	54.1034582	54.1113129	(54.1113129,54.1034582)
48	Белорецк	Башкортостан	53.9676488	58.4100419	(58.4100419,53.9676488)
49	Бирск	Башкортостан	55.4155753	55.5582214	(55.5582214,55.4155753)
50	Благовещенск	Башкортостан	55.0499867	55.9553186	(55.9553186,55.0499867)
51	Давлеканово	Башкортостан	54.2226707	55.0312373	(55.0312373,54.2226707)
52	Дюртюли	Башкортостан	55.4848318	54.8524765	(54.8524765,55.4848318)
53	Ишимбай	Башкортостан	53.4545764	56.0438751	(56.0438751,53.4545764)
54	Кумертау	Башкортостан	52.7564939	55.7970197	(55.7970197,52.7564939)
55	Межгорье	Башкортостан	54.2397689	57.9614547	(57.9614547,54.2397689)
56	Мелеуз	Башкортостан	52.9589532	55.9282838	(55.9282838,52.9589532)
57	Нефтекамск	Башкортостан	56.088377	54.2483061	(54.2483061,56.088377)
58	Октябрьский	Башкортостан	54.4815311	53.4655972	(53.4655972,54.4815311)
59	Салават	Башкортостан	53.3616974	55.9245224	(55.9245224,53.3616974)
60	Сибай	Башкортостан	52.7204651	58.6663783	(58.6663783,52.7204651)
61	Стерлитамак	Башкортостан	53.6300864	55.9317089	(55.9317089,53.6300864)
62	Туймазы	Башкортостан	54.5999224	53.6950623	(53.6950623,54.5999224)
63	Уфа	Башкортостан	54.734944	55.9578468	(55.9578468,54.734944)
64	Учалы	Башкортостан	54.3067375	59.4125461	(59.4125461,54.3067375)
65	Янаул	Башкортостан	56.2650146	54.929907	(54.929907,56.2650146)
66	Алексеевка	Белгородская	50.6299647	38.6880342	(38.6880342,50.6299647)
67	Белгород	Белгородская	50.5976472	36.5856652	(36.5856652,50.5976472)
68	Бирюч	Белгородская	50.6484585	38.4005083	(38.4005083,50.6484585)
69	Валуйки	Белгородская	50.2111207	38.0998772	(38.0998772,50.2111207)
70	Грайворон	Белгородская	50.4862958	35.6663877	(35.6663877,50.4862958)
71	Губкин	Белгородская	51.2837123	37.5347759	(37.5347759,51.2837123)
72	Короча	Белгородская	50.8129041	37.1896436	(37.1896436,50.8129041)
73	Новый Оскол	Белгородская	50.7633747	37.8775484	(37.8775484,50.7633747)
74	Старый Оскол	Белгородская	51.2967101	37.8350182	(37.8350182,51.2967101)
75	Строитель	Белгородская	50.7845099	36.4887648	(36.4887648,50.7845099)
76	Шебекино	Белгородская	50.4004883	36.8877889	(36.8877889,50.4004883)
77	Брянск	Брянская	53.2419535	34.3652146	(34.3652146,53.2419535)
78	Дятьково	Брянская	53.5958178	34.3551812	(34.3551812,53.5958178)
79	Жуковка	Брянская	53.5340397	33.7302579	(33.7302579,53.5340397)
80	Злынка	Брянская	52.4267015	31.7360399	(31.7360399,52.4267015)
81	Карачев	Брянская	53.1296524	34.9888727	(34.9888727,53.1296524)
82	Клинцы	Брянская	52.7529119	32.233911	(32.233911,52.7529119)
83	Мглин	Брянская	53.0599771	32.8468129	(32.8468129,53.0599771)
84	Новозыбков	Брянская	52.537173	31.9357991	(31.9357991,52.537173)
85	Почеп	Брянская	52.9154851	33.4744058	(33.4744058,52.9154851)
86	Севск	Брянская	52.1483358	34.4918415	(34.4918415,52.1483358)
87	Сельцо	Брянская	53.3739884	34.1059172	(34.1059172,53.3739884)
88	Стародуб	Брянская	52.5852257	32.760403	(32.760403,52.5852257)
89	Сураж	Брянская	53.0170888	32.3938878	(32.3938878,53.0170888)
90	Трубчевск	Брянская	52.5791734	33.7660547	(33.7660547,52.5791734)
91	Унеча	Брянская	52.8461199	32.6757629	(32.6757629,52.8461199)
92	Фокино	Брянская	53.4554145	34.4159238	(34.4159238,53.4554145)
93	Бабушкин	Бурятия	51.7112755	105.8673219	(105.8673219,51.7112755)
94	Гусиноозерск	Бурятия	51.2865048	106.5230319	(106.5230319,51.2865048)
95	Закаменск	Бурятия	50.372713	103.286699	(103.286699,50.372713)
96	Кяхта	Бурятия	50.346543	106.4533516	(106.4533516,50.346543)
97	Северобайкальск	Бурятия	55.635614	109.3361505	(109.3361505,55.635614)
98	Улан-Удэ	Бурятия	51.8335853	107.5842223	(107.5842223,51.8335853)
99	Александров	Владимирская	56.391819	38.7111123	(38.7111123,56.391819)
100	Владимир	Владимирская	56.1280804	40.4084376	(40.4084376,56.1280804)
101	Вязники	Владимирская	56.29773	42.2687398	(42.2687398,56.29773)
102	Гороховец	Владимирская	56.2021036	42.6926111	(42.6926111,56.2021036)
103	Гусь-Хрустальный	Владимирская	55.6198751	40.6579929	(40.6579929,55.6198751)
104	Камешково	Владимирская	56.3490152	40.9955183	(40.9955183,56.3490152)
105	Карабаново	Владимирская	56.3131822	38.7034257	(38.7034257,56.3131822)
106	Киржач	Владимирская	56.1486863	38.8635701	(38.8635701,56.1486863)
107	Ковров	Владимирская	56.3554349	41.3170576	(41.3170576,56.3554349)
108	Кольчугино	Владимирская	56.3327254	39.391336	(39.391336,56.3327254)
109	Костерево	Владимирская	55.9337222	39.6247398	(39.6247398,55.9337222)
110	Курлово	Владимирская	55.452698	40.6124108	(40.6124108,55.452698)
111	Лакинск	Владимирская	56.0180587	39.956551	(39.956551,56.0180587)
112	Меленки	Владимирская	55.3387515	41.6340046	(41.6340046,55.3387515)
113	Муром	Владимирская	55.5630311	42.0231362	(42.0231362,55.5630311)
114	Петушки	Владимирская	55.9298134	39.4508075	(39.4508075,55.9298134)
115	Покров	Владимирская	55.9166398	39.1734526	(39.1734526,55.9166398)
116	Радужный	Владимирская	55.9960277	40.3321855	(40.3321855,55.9960277)
117	Собинка	Владимирская	55.9939169	40.0179653	(40.0179653,55.9939169)
118	Струнино	Владимирская	56.3749967	38.5839667	(38.5839667,56.3749967)
119	Судогда	Владимирская	55.9498056	40.8562939	(40.8562939,55.9498056)
120	Суздаль	Владимирская	56.4274441	40.4525692	(40.4525692,56.4274441)
121	Юрьев-Польский	Владимирская	56.4937757	39.6680539	(39.6680539,56.4937757)
122	Волгоград	Волгоградская	48.7070042	44.5170339	(44.5170339,48.7070042)
123	Волжский	Волгоградская	48.7978209	44.7462538	(44.7462538,48.7978209)
124	Дубовка	Волгоградская	49.0554742	44.8270085	(44.8270085,49.0554742)
125	Жирновск	Волгоградская	50.9768814	44.7858202	(44.7858202,50.9768814)
126	Калач-на-Дону	Волгоградская	48.6889024	43.5306303	(43.5306303,48.6889024)
127	Камышин	Волгоградская	50.0651529	45.3844202	(45.3844202,50.0651529)
128	Котельниково	Волгоградская	47.6310259	43.1330872	(43.1330872,47.6310259)
129	Котово	Волгоградская	50.3205766	44.8030699	(44.8030699,50.3205766)
130	Краснослободск	Волгоградская	48.7068721	44.5630857	(44.5630857,48.7068721)
131	Ленинск	Волгоградская	48.6936061	45.1992692	(45.1992692,48.6936061)
132	Михайловка	Волгоградская	50.0708719	43.2401512	(43.2401512,50.0708719)
133	Николаевск	Волгоградская	50.0165306	45.4731658	(45.4731658,50.0165306)
134	Новоаннинский	Волгоградская	50.5296067	42.6666439	(42.6666439,50.5296067)
135	Палласовка	Волгоградская	50.0500944	46.8804277	(46.8804277,50.0500944)
136	Петров Вал	Волгоградская	50.1380557	45.20914	(45.20914,50.1380557)
137	Серафимович	Волгоградская	49.5663183	42.7360402	(42.7360402,49.5663183)
138	Суровикино	Волгоградская	48.618917	42.8541163	(42.8541163,48.618917)
139	Урюпинск	Волгоградская	50.7903789	42.0288513	(42.0288513,50.7903789)
140	Фролово	Волгоградская	49.7649148	43.6648641	(43.6648641,49.7649148)
141	Бабаево	Вологодская	59.3892583	35.9377058	(35.9377058,59.3892583)
142	Белозерск	Вологодская	60.0308381	37.7890586	(37.7890586,60.0308381)
143	Великий Устюг	Вологодская	60.7603913	46.3054414	(46.3054414,60.7603913)
144	Вологда	Вологодская	59.2483905	39.8355662	(39.8355662,59.2483905)
145	Вытегра	Вологодская	61.0063465	36.4495137	(36.4495137,61.0063465)
146	Грязовец	Вологодская	58.8757553	40.2485362	(40.2485362,58.8757553)
147	Кадников	Вологодская	59.5037764	40.3441148	(40.3441148,59.5037764)
148	Кириллов	Вологодская	59.8591523	38.3748782	(38.3748782,59.8591523)
149	Красавино	Вологодская	60.9612823	46.4814116	(46.4814116,60.9612823)
150	Никольск	Вологодская	59.5351837	45.4576137	(45.4576137,59.5351837)
151	Сокол	Вологодская	59.4758605	40.1114187	(40.1114187,59.4758605)
152	Тотьма	Вологодская	59.9734998	42.7589506	(42.7589506,59.9734998)
153	Устюжна	Вологодская	58.8383117	36.4425478	(36.4425478,58.8383117)
154	Харовск	Вологодская	59.9479423	40.2000298	(40.2000298,59.9479423)
155	Череповец	Вологодская	59.1269212	37.9090497	(37.9090497,59.1269212)
156	Бобров	Воронежская	51.0901649	40.0318256	(40.0318256,51.0901649)
157	Богучар	Воронежская	49.9352454	40.5590801	(40.5590801,49.9352454)
158	Борисоглебск	Воронежская	51.3655754	42.1008334	(42.1008334,51.3655754)
159	Бутурлиновка	Воронежская	50.8311818	40.5976923	(40.5976923,50.8311818)
160	Воронеж	Воронежская	51.6593332	39.1969229	(39.1969229,51.6593332)
161	Калач	Воронежская	50.4242134	41.0162014	(41.0162014,50.4242134)
162	Лиски	Воронежская	50.9945626	39.5184909	(39.5184909,50.9945626)
163	Нововоронеж	Воронежская	51.3091524	39.2162843	(39.2162843,51.3091524)
164	Новохоперск	Воронежская	51.0952211	41.6173404	(41.6173404,51.0952211)
165	Острогожск	Воронежская	50.8677905	39.0407746	(39.0407746,50.8677905)
166	Павловск	Воронежская	50.453455	40.136874	(40.136874,50.453455)
167	Поворино	Воронежская	51.1954419	42.2472726	(42.2472726,51.1954419)
168	Россошь	Воронежская	50.1701949	39.6226965	(39.6226965,50.1701949)
169	Семилуки	Воронежская	51.6951644	39.0190454	(39.0190454,51.6951644)
170	Эртиль	Воронежская	51.830932	40.8074182	(40.8074182,51.830932)
171	Буйнакск	Дагестан	42.8214424	47.1165263	(47.1165263,42.8214424)
172	Дагестанские Огни	Дагестан	42.1152296	48.1939354	(48.1939354,42.1152296)
173	Дербент	Дагестан	42.058966	48.2907452	(48.2907452,42.058966)
174	Избербаш	Дагестан	42.5650962	47.8710051	(47.8710051,42.5650962)
175	Каспийск	Дагестан	42.8916007	47.6367066	(47.6367066,42.8916007)
176	Кизилюрт	Дагестан	43.203825	46.8729636	(46.8729636,43.203825)
177	Кизляр	Дагестан	43.8484083	46.7233699	(46.7233699,43.8484083)
178	Махачкала	Дагестан	42.9849159	47.5047181	(47.5047181,42.9849159)
179	Хасавюрт	Дагестан	43.2504665	46.5851292	(46.5851292,43.2504665)
180	Южно-Сухокумск	Дагестан	44.6602467	45.6499523	(45.6499523,44.6602467)
181	Биробиджан	Еврейская	48.7946446	132.9217207	(132.9217207,48.7946446)
182	Облучье	Еврейская	49.0189345	131.0540102	(131.0540102,49.0189345)
183	Балей	Забайкальский	51.5823759	116.6379549	(116.6379549,51.5823759)
184	Борзя	Забайкальский	50.3876058	116.5234779	(116.5234779,50.3876058)
185	Краснокаменск	Забайкальский	50.0929703	118.0323936	(118.0323936,50.0929703)
186	Могоча	Забайкальский	53.7361398	119.7660867	(119.7660867,53.7361398)
187	Нерчинск	Забайкальский	51.9594977	116.5852383	(116.5852383,51.9594977)
188	Петровск-Забайкальский	Забайкальский	51.2748592	108.846681	(108.846681,51.2748592)
189	Сретенск	Забайкальский	52.2461454	117.7117842	(117.7117842,52.2461454)
190	Хилок	Забайкальский	51.3634856	110.4590898	(110.4590898,51.3634856)
191	Чита	Забайкальский	52.0340142	113.4994	(113.4994,52.0340142)
192	Шилка	Забайкальский	51.8497035	116.0334461	(116.0334461,51.8497035)
193	Вичуга	Ивановская	57.2044698	41.9132201	(41.9132201,57.2044698)
194	Гаврилов Посад	Ивановская	56.5586946	40.1228906	(40.1228906,56.5586946)
195	Заволжск	Ивановская	57.4918141	42.1375625	(42.1375625,57.4918141)
196	Иваново	Ивановская	56.9993792	40.9728272	(40.9728272,56.9993792)
197	Кинешма	Ивановская	57.4425463	42.168914	(42.168914,57.4425463)
198	Комсомольск	Ивановская	57.0273052	40.3776851	(40.3776851,57.0273052)
199	Кохма	Ивановская	56.9324606	41.0931657	(41.0931657,56.9324606)
200	Липецк	Липецкая	52.610249	39.5947883	(39.5947883,52.610249)
201	Наволоки	Ивановская	57.4679066	41.9608002	(41.9608002,57.4679066)
202	Плес	Ивановская	57.4606031	41.5122672	(41.5122672,57.4606031)
203	Приволжск	Ивановская	57.3805743	41.2808565	(41.2808565,57.3805743)
204	Пучеж	Ивановская	56.9820688	43.1683321	(43.1683321,56.9820688)
205	Родники	Ивановская	57.1025975	41.7298834	(41.7298834,57.1025975)
206	Тейково	Ивановская	56.8542719	40.5353874	(40.5353874,56.8542719)
207	Фурманов	Ивановская	57.2539276	41.1054432	(41.1054432,57.2539276)
208	Шуя	Ивановская	56.8560234	41.3800939	(41.3800939,56.8560234)
209	Южа	Ивановская	56.5926877	42.0458099	(42.0458099,56.5926877)
210	Юрьевец	Ивановская	57.3177781	43.1110401	(43.1110401,57.3177781)
211	Карабулак	Ингушетия	43.3055248	44.9094582	(44.9094582,43.3055248)
212	Магас	Ингушетия	43.1688611	44.8131207	(44.8131207,43.1688611)
213	Малгобек	Ингушетия	43.5096646	44.5901963	(44.5901963,43.5096646)
214	Назрань	Ингушетия	43.2257841	44.7645779	(44.7645779,43.2257841)
215	Сунжа	Ингушетия	43.3204196	45.0476331	(45.0476331,43.3204196)
216	Алзамай	Иркутская	55.5551233	98.6643699	(98.6643699,55.5551233)
217	Ангарск	Иркутская	52.544879	103.888543	(103.888543,52.544879)
218	Байкальск	Иркутская	51.5230393	104.1487532	(104.1487532,51.5230393)
219	Бирюсинск	Иркутская	55.9609167	97.8205348	(97.8205348,55.9609167)
220	Бодайбо	Иркутская	57.8468636	114.1866287	(114.1866287,57.8468636)
221	Братск	Иркутская	56.1513108	101.6340035	(101.6340035,56.1513108)
222	Вихоревка	Иркутская	56.1208145	101.1702926	(101.1702926,56.1208145)
223	Железногорск-Илимский	Иркутская	56.5847888	104.114275	(104.114275,56.5847888)
224	Зима	Иркутская	53.920693	102.0491772	(102.0491772,53.920693)
225	Иркутск	Иркутская	52.2864036	104.2807466	(104.2807466,52.2864036)
226	Киренск	Иркутская	57.7756595	108.1109412	(108.1109412,57.7756595)
227	Нижнеудинск	Иркутская	54.8968931	99.0314056	(99.0314056,54.8968931)
228	Саянск	Иркутская	54.1107238	102.18015	(102.18015,54.1107238)
229	Свирск	Иркутская	53.0842668	103.3364093	(103.3364093,53.0842668)
230	Слюдянка	Иркутская	51.6563983	103.7187545	(103.7187545,51.6563983)
231	Тайшет	Иркутская	55.9405334	98.0030145	(98.0030145,55.9405334)
232	Тулун	Иркутская	54.557162	100.5780603	(100.5780603,54.557162)
233	Усолье-Сибирское	Иркутская	52.7565808	103.6388109	(103.6388109,52.7565808)
234	Усть-Илимск	Иркутская	57.9430504	102.7415734	(102.7415734,57.9430504)
235	Усть-Кут	Иркутская	56.7928178	105.7757343	(105.7757343,56.7928178)
236	Черемхово	Иркутская	53.1369095	103.0901268	(103.0901268,53.1369095)
237	Шелехов	Иркутская	52.2102538	104.0973294	(104.0973294,52.2102538)
238	Баксан	Кабардино-Балкарская	43.6819137	43.5345036	(43.5345036,43.6819137)
239	Майский	Кабардино-Балкарская	43.6281516	44.0517314	(44.0517314,43.6281516)
240	Нальчик	Кабардино-Балкарская	43.4845464	43.60713	(43.60713,43.4845464)
241	Нарткала	Кабардино-Балкарская	43.5578075	43.8575925	(43.8575925,43.5578075)
242	Прохладный	Кабардино-Балкарская	43.7589602	44.0102409	(44.0102409,43.7589602)
243	Терек	Кабардино-Балкарская	43.4839358	44.1402161	(44.1402161,43.4839358)
244	Тырныауз	Кабардино-Балкарская	43.3981585	42.9213582	(42.9213582,43.3981585)
245	Чегем	Кабардино-Балкарская	43.5671525	43.5865792	(43.5865792,43.5671525)
246	Багратионовск	Калининградская	54.3866518	20.6418091	(20.6418091,54.3866518)
247	Балтийск	Калининградская	54.6513372	19.9140572	(19.9140572,54.6513372)
248	Гвардейск	Калининградская	54.6588378	21.0501388	(21.0501388,54.6588378)
249	Гурьевск	Калининградская	54.770638	20.6039767	(20.6039767,54.770638)
250	Гусев	Калининградская	54.5915455	22.1942445	(22.1942445,54.5915455)
251	Зеленоградск	Калининградская	54.9600185	20.4753652	(20.4753652,54.9600185)
252	Калининград	Калининградская	54.7074702	20.5073241	(20.5073241,54.7074702)
253	Краснознаменск	Калининградская	54.9453423	22.4928745	(22.4928745,54.9453423)
254	Ладушкин	Калининградская	54.5692156	20.1690153	(20.1690153,54.5692156)
255	Мамоново	Калининградская	54.4646036	19.9453482	(19.9453482,54.4646036)
256	Неман	Калининградская	55.0316524	22.0324064	(22.0324064,55.0316524)
257	Нестеров	Калининградская	54.6313814	22.5713736	(22.5713736,54.6313814)
258	Озерск	Калининградская	54.4084705	22.0134438	(22.0134438,54.4084705)
259	Пионерский	Калининградская	54.9516574	20.2277424	(20.2277424,54.9516574)
260	Полесск	Калининградская	54.8625126	21.0998067	(21.0998067,54.8625126)
261	Правдинск	Калининградская	54.4430986	21.0085269	(21.0085269,54.4430986)
262	Приморск	Калининградская	54.7311437	19.9981926	(19.9981926,54.7311437)
263	Светлогорск	Калининградская	54.9439286	20.1514295	(20.1514295,54.9439286)
264	Светлый	Калининградская	54.6772897	20.1357595	(20.1357595,54.6772897)
265	Славск	Калининградская	55.0449714	21.6742367	(21.6742367,55.0449714)
266	Советск	Калининградская	55.0809336	21.8886106	(21.8886106,55.0809336)
267	Черняховск	Калининградская	54.6244751	21.7969062	(21.7969062,54.6244751)
268	Городовиковск	Калмыкия	46.0875083	41.935537	(41.935537,46.0875083)
269	Лагань	Калмыкия	45.3930912	47.3432602	(47.3432602,45.3930912)
270	Элиста	Калмыкия	46.3083344	44.2702088	(44.2702088,46.3083344)
271	Балабаново	Калужская	55.1773714	36.6566951	(36.6566951,55.1773714)
272	Белоусово	Калужская	55.0956803	36.677629	(36.677629,55.0956803)
273	Боровск	Калужская	55.2130096	36.4926251	(36.4926251,55.2130096)
274	Ермолино	Калужская	55.1971758	36.5952722	(36.5952722,55.1971758)
275	Жиздра	Калужская	53.7521926	34.7386592	(34.7386592,53.7521926)
276	Жуков	Калужская	55.0301833	36.7394903	(36.7394903,55.0301833)
277	Калуга	Калужская	54.5059848	36.2516245	(36.2516245,54.5059848)
278	Киров	Калужская	54.0790111	34.3076201	(34.3076201,54.0790111)
279	Козельск	Калужская	54.0347201	35.780768	(35.780768,54.0347201)
280	Кондрово	Калужская	54.7959473	35.9274842	(35.9274842,54.7959473)
281	Кременки	Калужская	54.8862447	37.1168701	(37.1168701,54.8862447)
282	Людиново	Калужская	53.8700828	34.4385915	(34.4385915,53.8700828)
283	Малоярославец	Калужская	55.0177123	36.4633603	(36.4633603,55.0177123)
284	Медынь	Калужская	54.9689785	35.8872168	(35.8872168,54.9689785)
285	Мещовск	Калужская	54.3191471	35.2816918	(35.2816918,54.3191471)
286	Мосальск	Калужская	54.4824939	34.9872239	(34.9872239,54.4824939)
287	Обнинск	Калужская	55.0943144	36.6121639	(36.6121639,55.0943144)
288	Сосенский	Калужская	54.0566016	35.9621646	(35.9621646,54.0566016)
289	Спас-Деменск	Калужская	54.409922	34.0189631	(34.0189631,54.409922)
290	Сухиничи	Калужская	54.097296	35.3443568	(35.3443568,54.097296)
291	Таруса	Калужская	54.7236477	37.1671	(37.1671,54.7236477)
292	Юхнов	Калужская	54.7446445	35.2424346	(35.2424346,54.7446445)
293	Вилючинск	Камчатский	52.9302415	158.4057632	(158.4057632,52.9302415)
294	Елизово	Камчатский	53.1830375	158.3883548	(158.3883548,53.1830375)
295	Петропавловск-Камчатский	Камчатский	53.036908	158.6559254	(158.6559254,53.036908)
296	Карачаевск	Карачаево-Черкесская	43.7732525	41.9143472	(41.9143472,43.7732525)
297	Теберда	Карачаево-Черкесская	43.4437731	41.7415142	(41.7415142,43.4437731)
298	Усмань	Липецкая	52.0442648	39.726401	(39.726401,52.0442648)
299	Усть-Джегута	Карачаево-Черкесская	44.0838442	41.9711046	(41.9711046,44.0838442)
300	Черкесск	Карачаево-Черкесская	44.2269425	42.0466704	(42.0466704,44.2269425)
301	Беломорск	Карелия	64.5378417	34.7799462	(34.7799462,64.5378417)
302	Кемь	Карелия	64.9543539	34.5949263	(34.5949263,64.9543539)
303	Кондопога	Карелия	62.2059817	34.2682122	(34.2682122,62.2059817)
304	Костомукша	Карелия	64.5889398	30.6016832	(30.6016832,64.5889398)
305	Лахденпохья	Карелия	61.518881	30.1996116	(30.1996116,61.518881)
306	Медвежьегорск	Карелия	62.9127626	34.4568489	(34.4568489,62.9127626)
307	Олонец	Карелия	60.9794025	32.9725519	(32.9725519,60.9794025)
308	Петрозаводск	Карелия	61.7891264	34.3596434	(34.3596434,61.7891264)
309	Питкяранта	Карелия	61.5757191	31.4640557	(31.4640557,61.5757191)
310	Пудож	Карелия	61.8058821	36.5329941	(36.5329941,61.8058821)
311	Сегежа	Карелия	63.7437572	34.3126982	(34.3126982,63.7437572)
312	Сортавала	Карелия	61.703367	30.6916998	(30.6916998,61.703367)
313	Суоярви	Карелия	62.0787293	32.3499386	(32.3499386,62.0787293)
314	Анжеро-Судженск	Кемеровская область - Кузбасс	56.0786281	86.0201278	(86.0201278,56.0786281)
315	Белово	Кемеровская область - Кузбасс	54.4220968	86.3037373	(86.3037373,54.4220968)
908	Бавлы	Татарстан	54.4062891	53.2458065	(53.2458065,54.4062891)
316	Березовский	Кемеровская область - Кузбасс	55.6693513	86.2744459	(86.2744459,55.6693513)
317	Гурьевск	Кемеровская область - Кузбасс	54.2859263	85.9475985	(85.9475985,54.2859263)
318	Калтан	Кемеровская область - Кузбасс	53.5210919	87.2771636	(87.2771636,53.5210919)
319	Кемерово	Кемеровская область - Кузбасс	55.3910651	86.0467781	(86.0467781,55.3910651)
320	Киселевск	Кемеровская область - Кузбасс	54.0059999	86.6366116	(86.6366116,54.0059999)
321	Ленинск-Кузнецкий	Кемеровская область - Кузбасс	54.6674492	86.1797324	(86.1797324,54.6674492)
322	Мариинск	Кемеровская область - Кузбасс	56.2127383	87.7454924	(87.7454924,56.2127383)
323	Междуреченск	Кемеровская область - Кузбасс	53.6865289	88.0702754	(88.0702754,53.6865289)
324	Мыски	Кемеровская область - Кузбасс	53.7125695	87.8055646	(87.8055646,53.7125695)
325	Новокузнецк	Кемеровская область - Кузбасс	53.794315	87.2142745	(87.2142745,53.794315)
326	Осинники	Кемеровская область - Кузбасс	53.5988055	87.3371272	(87.3371272,53.5988055)
327	Полысаево	Кемеровская область - Кузбасс	54.6055	86.2809208	(86.2809208,54.6055)
328	Прокопьевск	Кемеровская область - Кузбасс	53.8604265	86.7183577	(86.7183577,53.8604265)
329	Салаир	Кемеровская область - Кузбасс	54.2351735	85.8030733	(85.8030733,54.2351735)
330	Тайга	Кемеровская область - Кузбасс	56.0622131	85.6207182	(85.6207182,56.0622131)
331	Таштагол	Кемеровская область - Кузбасс	52.759313	87.8476546	(87.8476546,52.759313)
332	Топки	Кемеровская область - Кузбасс	55.2764707	85.6152619	(85.6152619,55.2764707)
333	Юрга	Кемеровская область - Кузбасс	55.7202694	84.8886399	(84.8886399,55.7202694)
334	Белая Холуница	Кировская	58.8415239	50.8460699	(50.8460699,58.8415239)
335	Вятские Поляны	Кировская	56.2284817	51.0614855	(51.0614855,56.2284817)
336	Зуевка	Кировская	58.4032152	51.1331606	(51.1331606,58.4032152)
337	Киров	Кировская	58.6035264	49.6679304	(49.6679304,58.6035264)
338	Кирово-Чепецк	Кировская	58.5559424	50.0316848	(50.0316848,58.5559424)
339	Кирс	Кировская	59.340056	52.2414437	(52.2414437,59.340056)
340	Котельнич	Кировская	58.3034832	48.3475597	(48.3475597,58.3034832)
341	Луза	Кировская	60.6290609	47.2612445	(47.2612445,60.6290609)
342	Малмыж	Кировская	56.5243844	50.6782739	(50.6782739,56.5243844)
343	Мураши	Кировская	59.3955383	48.9638417	(48.9638417,59.3955383)
344	Нолинск	Кировская	57.5597284	49.93575	(49.93575,57.5597284)
345	Омутнинск	Кировская	58.6698913	52.1894564	(52.1894564,58.6698913)
346	Орлов	Кировская	58.5389776	48.8927723	(48.8927723,58.5389776)
347	Слободской	Кировская	58.7311574	50.1669249	(50.1669249,58.7311574)
348	Советск	Кировская	57.584196	48.9590272	(48.9590272,57.584196)
349	Сосновка	Кировская	56.2532741	51.2833642	(51.2833642,56.2532741)
350	Уржум	Кировская	57.1097477	50.0058097	(50.0058097,57.1097477)
351	Яранск	Кировская	57.3040326	47.8478737	(47.8478737,57.3040326)
352	Воркута	Коми	67.4974082	64.061034	(64.061034,67.4974082)
353	Вуктыл	Коми	63.8615274	57.3165402	(57.3165402,63.8615274)
354	Емва	Коми	62.5965137	50.8732125	(50.8732125,62.5965137)
355	Инта	Коми	66.0367316	60.1152961	(60.1152961,66.0367316)
356	Микунь	Коми	62.3579068	50.0719503	(50.0719503,62.3579068)
357	Печора	Коми	65.148584	57.2239777	(57.2239777,65.148584)
358	Сосногорск	Коми	63.5989841	53.876293	(53.876293,63.5989841)
359	Сыктывкар	Коми	61.6686617	50.8358151	(50.8358151,61.6686617)
360	Усинск	Коми	65.994147	57.5569423	(57.5569423,65.994147)
361	Ухта	Коми	63.5565514	53.7014239	(53.7014239,63.5565514)
362	Буй	Костромская	58.4733277	41.5306822	(41.5306822,58.4733277)
363	Волгореченск	Костромская	57.4424559	41.1594201	(41.1594201,57.4424559)
364	Галич	Костромская	58.3828191	42.3654013	(42.3654013,58.3828191)
365	Кологрив	Костромская	58.8269323	44.3184927	(44.3184927,58.8269323)
366	Кострома	Костромская	57.768	40.927	(40.927,57.768)
367	Макарьев	Костромская	57.8807152	43.8014197	(43.8014197,57.8807152)
368	Мантурово	Костромская	58.3265441	44.757494	(44.757494,58.3265441)
369	Нерехта	Костромская	57.4543369	40.5723598	(40.5723598,57.4543369)
370	Нея	Костромская	58.2943349	43.8780948	(43.8780948,58.2943349)
371	Солигалич	Костромская	59.0784867	42.2878423	(42.2878423,59.0784867)
372	Чухлома	Костромская	58.753421	42.6884958	(42.6884958,58.753421)
373	Шарья	Костромская	58.3760542	45.4062414	(45.4062414,58.3760542)
374	Абинск	Краснодарский	44.8679655	38.1618157	(38.1618157,44.8679655)
375	Анапа	Краснодарский	44.8950433	37.3163282	(37.3163282,44.8950433)
376	Апшеронск	Краснодарский	44.4584006	39.7299824	(39.7299824,44.4584006)
377	Армавир	Краснодарский	45.0012149	41.1324168	(41.1324168,45.0012149)
378	Белореченск	Краснодарский	44.7651876	39.8781494	(39.8781494,44.7651876)
379	Геленджик	Краснодарский	44.5630007	38.0790852	(38.0790852,44.5630007)
380	Горячий Ключ	Краснодарский	44.6344864	39.1354738	(39.1354738,44.6344864)
381	Гулькевичи	Краснодарский	45.3605121	40.6918389	(40.6918389,45.3605121)
382	Ейск	Краснодарский	46.71157	38.2763895	(38.2763895,46.71157)
383	Кореновск	Краснодарский	45.4641703	39.458949	(39.458949,45.4641703)
384	Краснодар	Краснодарский	45.0401604	38.9759647	(38.9759647,45.0401604)
385	Кропоткин	Краснодарский	45.4333007	40.5727951	(40.5727951,45.4333007)
386	Крымск	Краснодарский	44.9344404	37.9855795	(37.9855795,44.9344404)
387	Курганинск	Краснодарский	44.8877025	40.5913245	(40.5913245,44.8877025)
388	Лабинск	Краснодарский	44.6354363	40.7245341	(40.7245341,44.6354363)
389	Новокубанск	Краснодарский	45.1038699	41.0475175	(41.0475175,45.1038699)
390	Новороссийск	Краснодарский	44.7235026	37.7686135	(37.7686135,44.7235026)
391	Приморско-Ахтарск	Краснодарский	46.0515432	38.1704875	(38.1704875,46.0515432)
392	Славянск-на-Кубани	Краснодарский	45.2603626	38.1259774	(38.1259774,45.2603626)
393	Сочи	Краснодарский	43.5854551	39.7231548	(39.7231548,43.5854551)
394	Темрюк	Краснодарский	45.2610949	37.4454412	(37.4454412,45.2610949)
395	Тимашевск	Краснодарский	45.615923	38.9351837	(38.9351837,45.615923)
396	Тихорецк	Краснодарский	45.8546345	40.1260267	(40.1260267,45.8546345)
397	Туапсе	Краснодарский	44.1105335	39.0824904	(39.0824904,44.1105335)
398	Усть-Лабинск	Краснодарский	45.2227359	39.6929577	(39.6929577,45.2227359)
399	Хадыженск	Краснодарский	44.4122963	39.5320258	(39.5320258,44.4122963)
400	Артемовск	Красноярский	54.3473075	93.4358377	(93.4358377,54.3473075)
401	Ачинск	Красноярский	56.253907	90.4794397	(90.4794397,56.253907)
402	Боготол	Красноярский	56.2098468	89.5299336	(89.5299336,56.2098468)
403	Бородино	Красноярский	55.9054121	94.9020967	(94.9020967,55.9054121)
404	Дивногорск	Красноярский	55.9576784	92.3800687	(92.3800687,55.9576784)
405	Дудинка	Красноярский	69.4031364	86.1907218	(86.1907218,69.4031364)
406	Енисейск	Красноярский	58.4485261	92.1651083	(92.1651083,58.4485261)
407	Железногорск	Красноярский	56.2529035	93.532273	(93.532273,56.2529035)
408	Заозерный	Красноярский	55.9617752	94.7091491	(94.7091491,55.9617752)
409	Зеленогорск	Красноярский	56.1131564	94.5888103	(94.5888103,56.1131564)
410	Игарка	Красноярский	67.4666901	86.5812794	(86.5812794,67.4666901)
411	Иланский	Красноярский	56.2374037	96.067267	(96.067267,56.2374037)
412	Канск	Красноярский	56.2051282	95.7051096	(95.7051096,56.2051282)
413	Кодинск	Красноярский	58.6032644	99.1797962	(99.1797962,58.6032644)
414	Красноярск	Красноярский	56.0093879	92.8524806	(92.8524806,56.0093879)
415	Лесосибирск	Красноярский	58.221681	92.5037872	(92.5037872,58.221681)
416	Минусинск	Красноярский	53.7104586	91.6872907	(91.6872907,53.7104586)
417	Назарово	Красноярский	56.0113799	90.4168775	(90.4168775,56.0113799)
418	Норильск	Красноярский	69.3489978	88.2009846	(88.2009846,69.3489978)
419	Сосновоборск	Красноярский	56.1202647	93.3354121	(93.3354121,56.1202647)
420	Ужур	Красноярский	55.3141969	89.8333918	(89.8333918,55.3141969)
421	Уяр	Красноярский	55.8131263	94.3282601	(94.3282601,55.8131263)
422	Шарыпово	Красноярский	55.5389739	89.1801044	(89.1801044,55.5389739)
423	Ялта	Крым	44.4164605	34.0444797	(34.0444797,44.4164605)
424	Алушта	Крым	44.6764304	34.4100624	(34.4100624,44.6764304)
425	Армянск	Крым	46.1059307	33.6910012	(33.6910012,46.1059307)
426	Бахчисарай	Крым	44.7514769	33.8752176	(33.8752176,44.7514769)
427	Белогорск	Крым	45.057202	34.5999029	(34.5999029,45.057202)
428	Джанкой	Крым	45.7092306	34.3883372	(34.3883372,45.7092306)
429	Евпатория	Крым	45.190629	33.367634	(33.367634,45.190629)
430	Керчь	Крым	45.3562627	36.4674513	(36.4674513,45.3562627)
431	Красноперекопск	Крым	45.9537576	33.7921939	(33.7921939,45.9537576)
432	Саки	Крым	45.1341997	33.6033383	(33.6033383,45.1341997)
433	Симферополь	Крым	44.9482948	34.1001151	(34.1001151,44.9482948)
434	Старый Крым	Крым	45.029058	35.0901474	(35.0901474,45.029058)
435	Судак	Крым	44.8504679	34.9762034	(34.9762034,44.8504679)
436	Феодосия	Крым	45.0318393	35.3824259	(35.3824259,45.0318393)
437	Щелкино	Крым	45.4288991	35.825165	(35.825165,45.4288991)
438	Ялта	Крым	44.4953612	34.166308	(34.166308,44.4953612)
439	Далматово	Курганская	56.262114	62.9387011	(62.9387011,56.262114)
440	Катайск	Курганская	56.290809	62.5800359	(62.5800359,56.290809)
441	Курган	Курганская	55.4443883	65.3161963	(65.3161963,55.4443883)
442	Куртамыш	Курганская	54.9368539	64.4203722	(64.4203722,54.9368539)
443	Макушино	Курганская	55.2153947	67.2451705	(67.2451705,55.2153947)
444	Петухово	Курганская	55.0650077	67.8873408	(67.8873408,55.0650077)
445	Шадринск	Курганская	56.0870344	63.6297182	(63.6297182,56.0870344)
446	Шумиха	Курганская	55.2280246	63.2901272	(63.2901272,55.2280246)
447	Щучье	Курганская	55.2087637	62.7478548	(62.7478548,55.2087637)
448	Дмитриев	Курская	52.1268464	35.0739038	(35.0739038,52.1268464)
449	Железногорск	Курская	52.3380202	35.3516867	(35.3516867,52.3380202)
450	Курск	Курская	51.7303637	36.1925603	(36.1925603,51.7303637)
451	Курчатов	Курская	51.6604083	35.6572224	(35.6572224,51.6604083)
452	Льгов	Курская	51.6597148	35.2612491	(35.2612491,51.6597148)
453	Обоянь	Курская	51.2119324	36.2755133	(36.2755133,51.2119324)
454	Рыльск	Курская	51.5681314	34.6802597	(34.6802597,51.5681314)
455	Суджа	Курская	51.1918927	35.2720915	(35.2720915,51.1918927)
456	Фатеж	Курская	52.0917728	35.8538706	(35.8538706,52.0917728)
457	Щигры	Курская	51.8786014	36.8910945	(36.8910945,51.8786014)
458	Бокситогорск	Ленинградская	59.4734797	33.845688	(33.845688,59.4734797)
459	Волосово	Ленинградская	59.4445408	29.4923355	(29.4923355,59.4445408)
460	Волхов	Ленинградская	59.9005958	32.3520756	(32.3520756,59.9005958)
461	Всеволожск	Ленинградская	60.0191278	30.6456718	(30.6456718,60.0191278)
462	Выборг	Ленинградская	60.7130801	28.7328336	(28.7328336,60.7130801)
463	Высоцк	Ленинградская	60.6296236	28.5709314	(28.5709314,60.6296236)
464	Гатчина	Ленинградская	59.565237	30.1282473	(30.1282473,59.565237)
465	Ивангород	Ленинградская	59.3766119	28.2231659	(28.2231659,59.3766119)
466	Каменногорск	Ленинградская	60.950855	29.1308372	(29.1308372,60.950855)
467	Кингисепп	Ленинградская	59.3740435	28.6112444	(28.6112444,59.3740435)
468	Кириши	Ленинградская	59.4742862	32.0624947	(32.0624947,59.4742862)
469	Кировск	Ленинградская	59.8754216	30.981364	(30.981364,59.8754216)
470	Коммунар	Ленинградская	59.6215133	30.3934125	(30.3934125,59.6215133)
471	Кудрово	Ленинградская	59.9075226	30.5121008	(30.5121008,59.9075226)
472	Лодейное Поле	Ленинградская	60.7320936	33.5521022	(33.5521022,60.7320936)
473	Луга	Ленинградская	58.7374031	29.8465776	(29.8465776,58.7374031)
474	Любань	Ленинградская	59.3493847	31.2484801	(31.2484801,59.3493847)
475	Мурино	Ленинградская	60.044862	30.4571456	(30.4571456,60.044862)
476	Никольское	Ленинградская	59.7043309	30.7874571	(30.7874571,59.7043309)
477	Новая Ладога	Ленинградская	60.1100135	32.3141203	(32.3141203,60.1100135)
478	Отрадное	Ленинградская	59.7726848	30.7988557	(30.7988557,59.7726848)
479	Пикалево	Ленинградская	59.5132022	34.1772776	(34.1772776,59.5132022)
480	Подпорожье	Ленинградская	60.9127549	34.1567664	(34.1567664,60.9127549)
481	Приморск	Ленинградская	60.3660209	28.6135772	(28.6135772,60.3660209)
482	Приозерск	Ленинградская	61.0330896	30.1587851	(30.1587851,61.0330896)
483	Светогорск	Ленинградская	61.1111282	28.8725865	(28.8725865,61.1111282)
484	Сертолово	Ленинградская	60.1446932	30.2095918	(30.2095918,60.1446932)
485	Сланцы	Ленинградская	59.1178185	28.0881475	(28.0881475,59.1178185)
486	Сосновый Бор	Ленинградская	59.8772884	29.1291619	(29.1291619,59.8772884)
487	Сясьстрой	Ленинградская	60.1401739	32.5601559	(32.5601559,60.1401739)
488	Тихвин	Ленинградская	59.6272904	33.5072731	(33.5072731,59.6272904)
489	Тосно	Ленинградская	59.5407098	30.877812	(30.877812,59.5407098)
490	Шлиссельбург	Ленинградская	59.9443714	31.0333365	(31.0333365,59.9443714)
491	Грязи	Липецкая	52.4874097	39.9331142	(39.9331142,52.4874097)
492	Данков	Липецкая	53.2577411	39.1456184	(39.1456184,53.2577411)
493	Елец	Липецкая	52.6152411	38.5289342	(38.5289342,52.6152411)
494	Задонск	Липецкая	52.4004179	38.9205032	(38.9205032,52.4004179)
495	Лебедянь	Липецкая	53.0156117	39.143536	(39.143536,53.0156117)
496	Чаплыгин	Липецкая	53.24048	39.9670973	(39.9670973,53.24048)
497	Магадан	Магаданская	59.5681332	150.8084956	(150.8084956,59.5681332)
498	Сусуман	Магаданская	62.7805882	148.1540281	(148.1540281,62.7805882)
499	Волжск	Марий Эл	55.8623156	48.3715083	(48.3715083,55.8623156)
500	Звенигово	Марий Эл	55.9738571	48.0170245	(48.0170245,55.9738571)
501	Йошкар-Ола	Марий Эл	56.6343662	47.8999706	(47.8999706,56.6343662)
502	Козьмодемьянск	Марий Эл	56.3334036	46.546675	(46.546675,56.3334036)
503	Ардатов	Мордовия	54.8465544	46.2411232	(46.2411232,54.8465544)
504	Инсар	Мордовия	53.8770022	44.3696566	(44.3696566,53.8770022)
505	Ковылкино	Мордовия	54.0391072	43.9191539	(43.9191539,54.0391072)
506	Краснослободск	Мордовия	54.4248207	43.7845011	(43.7845011,54.4248207)
507	Рузаевка	Мордовия	54.0581967	44.9490466	(44.9490466,54.0581967)
508	Саранск	Мордовия	54.1809332	45.1862632	(45.1862632,54.1809332)
509	Темников	Мордовия	54.6310583	43.2161099	(43.2161099,54.6310583)
510	Апрелевка	Московская	55.5276918	37.065143	(37.065143,55.5276918)
511	Балашиха	Московская	55.796389	37.938283	(37.938283,55.796389)
512	Белоозёрский	Московская	55.4595766	38.4389742	(38.4389742,55.4595766)
513	Бронницы	Московская	55.4255379	38.264145	(38.264145,55.4255379)
514	Верея	Московская	55.343369	36.185694	(36.185694,55.343369)
515	Видное	Московская	55.551725	37.7061984	(37.7061984,55.551725)
516	Волоколамск	Московская	56.0356499	35.9585112	(35.9585112,56.0356499)
517	Высоковск	Московская	56.3359513	36.5251837	(36.5251837,56.3359513)
518	Голицыно	Московская	55.6190582	36.9856793	(36.9856793,55.6190582)
519	Дедовск	Московская	55.8703276	37.1245043	(37.1245043,55.8703276)
520	Дзержинский	Московская	55.6240869	37.8440276	(37.8440276,55.6240869)
521	Долгопрудный	Московская	55.9385999	37.5101021	(37.5101021,55.9385999)
522	Домодедово	Московская	55.4363283	37.7664984	(37.7664984,55.4363283)
523	Дрезна	Московская	55.7443143	38.8498479	(38.8498479,55.7443143)
524	Дубна	Московская	56.741786	37.1757223	(37.1757223,56.741786)
525	Егорьевск	Московская	55.3830113	39.0358317	(39.0358317,55.3830113)
526	Жуковский	Московская	55.599803	38.1224298	(38.1224298,55.599803)
527	Зарайск	Московская	54.762456	38.8850978	(38.8850978,54.762456)
528	Звенигород	Московская	55.7297089	36.8554029	(36.8554029,55.7297089)
529	Ивантеевка	Московская	55.9741665	37.9207539	(37.9207539,55.9741665)
530	Кашира	Московская	54.853337	38.1904392	(38.1904392,54.853337)
531	Коломна	Московская	55.102814	38.7531002	(38.7531002,55.102814)
532	Королёв	Московская	55.9161773	37.8545415	(37.8545415,55.9161773)
533	Котельники	Московская	55.6597925	37.8631156	(37.8631156,55.6597925)
534	Красноармейск	Московская	56.105426	38.140838	(38.140838,56.105426)
535	Красногорск	Московская	55.8317203	37.3295266	(37.3295266,55.8317203)
536	Краснозаводск	Московская	56.4409979	38.2320307	(38.2320307,56.4409979)
537	Краснознаменск	Московская	55.5978959	37.0393709	(37.0393709,55.5978959)
538	Кубинка	Московская	55.5754955	36.6951995	(36.6951995,55.5754955)
539	Куровское	Московская	55.5792277	38.9207723	(38.9207723,55.5792277)
540	Ликино-Дулёво	Московская	55.7078257	38.9578093	(38.9578093,55.7078257)
541	Лобня	Московская	56.0328881	37.4614035	(37.4614035,56.0328881)
542	Лосино-Петровский	Московская	55.8713214	38.200599	(38.200599,55.8713214)
543	Луховицы	Московская	54.9652077	39.0260266	(39.0260266,54.9652077)
544	Лыткарино	Московская	55.5778163	37.9033507	(37.9033507,55.5778163)
545	Люберцы	Московская	55.676499	37.898125	(37.898125,55.676499)
546	Можайск	Московская	55.5069259	36.024043	(36.024043,55.5069259)
547	Мытищи	Московская	55.9105782	37.7363579	(37.7363579,55.9105782)
548	Озёры	Московская	54.8541006	38.5599196	(38.5599196,54.8541006)
549	Павловский Посад	Московская	55.7807244	38.6596983	(38.6596983,55.7807244)
550	Пересвет	Московская	56.4158326	38.1733534	(38.1733534,56.4158326)
551	Подольск	Московская	55.4389322	37.5703482	(37.5703482,55.4389322)
552	Протвино	Московская	54.8705984	37.2182749	(37.2182749,54.8705984)
553	Пушкино	Московская	56.0103638	37.8471403	(37.8471403,56.0103638)
554	Пущино	Московская	54.8324412	37.6210346	(37.6210346,54.8324412)
555	Раменское	Московская	55.5495132	38.2728914	(38.2728914,55.5495132)
556	Реутов	Московская	55.7582621	37.8618553	(37.8618553,55.7582621)
557	Рошаль	Московская	55.6632776	39.8656147	(39.8656147,55.6632776)
558	Руза	Московская	55.7014744	36.1959206	(36.1959206,55.7014744)
559	Серпухов	Московская	54.9226466	37.4033859	(37.4033859,54.9226466)
560	Солнечногорск	Московская	56.185102	36.977631	(36.977631,56.185102)
561	Старая Купавна	Московская	55.810648	38.175624	(38.175624,55.810648)
562	Ступино	Московская	54.886274	38.078228	(38.078228,54.886274)
563	Талдом	Московская	56.7308564	37.5276003	(37.5276003,56.7308564)
564	Фрязино	Московская	55.9590588	38.0410235	(38.0410235,55.9590588)
565	Химки	Московская	55.888657	37.4303702	(37.4303702,55.888657)
566	Хотьково	Московская	56.2516982	37.9396017	(37.9396017,56.2516982)
567	Черноголовка	Московская	56.010005	38.379245	(38.379245,56.010005)
568	Чехов	Московская	55.1508011	37.4533252	(37.4533252,55.1508011)
569	Щёлково	Московская	55.9233801	37.9783707	(37.9783707,55.9233801)
570	Электрогорск	Московская	55.8780241	38.7806752	(38.7806752,55.8780241)
571	Электросталь	Московская	55.7847291	38.4447045	(38.4447045,55.7847291)
572	Электроугли	Московская	55.7170877	38.2192563	(38.2192563,55.7170877)
573	Яхрома	Московская	56.2890516	37.4831799	(37.4831799,56.2890516)
574	Апатиты	Мурманская	67.5677761	33.4067929	(33.4067929,67.5677761)
575	Гаджиево	Мурманская	69.2491311	33.315341	(33.315341,69.2491311)
576	Заозерск	Мурманская	69.4003584	32.4501496	(32.4501496,69.4003584)
577	Заполярный	Мурманская	69.4132852	30.7984312	(30.7984312,69.4132852)
578	Кандалакша	Мурманская	67.1567974	32.4143218	(32.4143218,67.1567974)
579	Кировск	Мурманская	67.6150424	33.663735	(33.663735,67.6150424)
580	Ковдор	Мурманская	67.5661417	30.4741941	(30.4741941,67.5661417)
581	Кола	Мурманская	68.8786028	33.0262299	(33.0262299,68.8786028)
582	Мончегорск	Мурманская	67.9386153	32.9359719	(32.9359719,67.9386153)
583	Мурманск	Мурманская	69.007721	33.0685865	(33.0685865,69.007721)
584	Оленегорск	Мурманская	68.1422058	33.2669407	(33.2669407,68.1422058)
585	Островной	Мурманская	68.0510344	39.5077846	(39.5077846,68.0510344)
586	Полярные Зори	Мурманская	67.373084	32.4975636	(32.4975636,67.373084)
587	Полярный	Мурманская	69.1989583	33.4508591	(33.4508591,69.1989583)
588	Североморск	Мурманская	69.0766801	33.4177759	(33.4177759,69.0766801)
589	Снежногорск	Мурманская	69.1921409	33.2383502	(33.2383502,69.1921409)
590	Нарьян-Мар	Ненецкий	67.6379672	53.0069565	(53.0069565,67.6379672)
591	Арзамас	Нижегородская	55.3945814	43.8408141	(43.8408141,55.3945814)
592	Балахна	Нижегородская	56.495036	43.5758423	(43.5758423,56.495036)
593	Богородск	Нижегородская	56.1020828	43.5135442	(43.5135442,56.1020828)
594	Бор	Нижегородская	56.3565458	44.0646481	(44.0646481,56.3565458)
595	Ветлуга	Нижегородская	57.8559204	45.7761957	(45.7761957,57.8559204)
596	Володарск	Нижегородская	56.2169751	43.1596417	(43.1596417,56.2169751)
597	Ворсма	Нижегородская	55.989943	43.2718859	(43.2718859,55.989943)
598	Выкса	Нижегородская	55.3207727	42.1678834	(42.1678834,55.3207727)
599	Горбатов	Нижегородская	56.1307769	43.0626185	(43.0626185,56.1307769)
600	Городец	Нижегородская	56.6449218	43.4723104	(43.4723104,56.6449218)
601	Дзержинск	Нижегородская	56.2376047	43.4599416	(43.4599416,56.2376047)
602	Заволжье	Нижегородская	56.6404286	43.3872492	(43.3872492,56.6404286)
603	Княгинино	Нижегородская	55.8205915	45.032337	(45.032337,55.8205915)
604	Кстово	Нижегородская	56.1432084	44.1664198	(44.1664198,56.1432084)
605	Кулебаки	Нижегородская	55.4296181	42.5125538	(42.5125538,55.4296181)
606	Лукоянов	Нижегородская	55.0326225	44.4933807	(44.4933807,55.0326225)
607	Лысково	Нижегородская	56.0262359	45.035771	(45.035771,56.0262359)
608	Навашино	Нижегородская	55.543811	42.1887089	(42.1887089,55.543811)
609	Нижний Новгород	Нижегородская	56.3240627	44.0053913	(44.0053913,56.3240627)
610	Павлово	Нижегородская	55.9797564	43.0995042	(43.0995042,55.9797564)
611	Первомайск	Нижегородская	54.8675792	43.8013992	(43.8013992,54.8675792)
612	Перевоз	Нижегородская	55.5967718	44.5448369	(44.5448369,55.5967718)
613	Саров	Нижегородская	54.9228268	43.3448089	(43.3448089,54.9228268)
614	Семенов	Нижегородская	56.7889794	44.4902885	(44.4902885,56.7889794)
615	Сергач	Нижегородская	55.5201515	45.4813231	(45.4813231,55.5201515)
616	Урень	Нижегородская	57.4612572	45.7833293	(45.7833293,57.4612572)
617	Чкаловск	Нижегородская	56.7651262	43.242077	(43.242077,56.7651262)
618	Шахунья	Нижегородская	57.6764293	46.6129009	(46.6129009,57.6764293)
619	Боровичи	Новгородская	58.3840197	33.9175929	(33.9175929,58.3840197)
620	Валдай	Новгородская	57.9823766	33.2369436	(33.2369436,57.9823766)
621	Великий Новгород	Новгородская	58.5213846	31.2755394	(31.2755394,58.5213846)
622	Малая Вишера	Новгородская	58.8458379	32.2247401	(32.2247401,58.8458379)
623	Окуловка	Новгородская	58.3910296	33.2901557	(33.2901557,58.3910296)
624	Пестово	Новгородская	58.5973723	35.8143898	(35.8143898,58.5973723)
625	Сольцы	Новгородская	58.1201281	30.309351	(30.309351,58.1201281)
626	Старая Русса	Новгородская	57.990737	31.3554897	(31.3554897,57.990737)
627	Холм	Новгородская	57.145108	31.1787499	(31.1787499,57.145108)
628	Чудово	Новгородская	59.1248394	31.6866241	(31.6866241,59.1248394)
629	Барабинск	Новосибирская	55.35146	78.3464506	(78.3464506,55.35146)
630	Бердск	Новосибирская	54.7582156	83.1070605	(83.1070605,54.7582156)
631	Болотное	Новосибирская	55.6692421	84.3906889	(84.3906889,55.6692421)
632	Искитим	Новосибирская	54.6267603	83.2951244	(83.2951244,54.6267603)
633	Карасук	Новосибирская	53.7343189	78.0422967	(78.0422967,53.7343189)
634	Каргат	Новосибирская	55.1945666	80.2829495	(80.2829495,55.1945666)
635	Куйбышев	Новосибирская	55.4685094	78.3242048	(78.3242048,55.4685094)
636	Купино	Новосибирская	54.366055	77.2973368	(77.2973368,54.366055)
637	Новосибирск	Новосибирская	55.028191	82.9211489	(82.9211489,55.028191)
638	Обь	Новосибирская	54.9945576	82.6937181	(82.6937181,54.9945576)
639	Татарск	Новосибирская	55.2146167	75.9739914	(75.9739914,55.2146167)
640	Тогучин	Новосибирская	55.2251631	84.4104118	(84.4104118,55.2251631)
641	Черепаново	Новосибирская	54.2206476	83.3724521	(83.3724521,54.2206476)
642	Чулым	Новосибирская	55.0906867	80.9592508	(80.9592508,55.0906867)
643	Исилькуль	Омская	54.9096002	71.2816284	(71.2816284,54.9096002)
644	Калачинск	Омская	55.0598155	74.5653644	(74.5653644,55.0598155)
645	Называевск	Омская	55.5689323	71.3503426	(71.3503426,55.5689323)
646	Омск	Омская	54.9848566	73.3674517	(73.3674517,54.9848566)
647	Тара	Омская	56.9160511	74.3649194	(74.3649194,56.9160511)
648	Тюкалинск	Омская	55.8703415	72.1954747	(72.1954747,55.8703415)
649	Абдулино	Оренбургская	53.6778906	53.6472483	(53.6472483,53.6778906)
650	Бугуруслан	Оренбургская	53.6523728	52.4326853	(52.4326853,53.6523728)
651	Бузулук	Оренбургская	52.7881277	52.2624877	(52.2624877,52.7881277)
652	Гай	Оренбургская	51.4649189	58.4436875	(58.4436875,51.4649189)
653	Кувандык	Оренбургская	51.4783857	57.3612636	(57.3612636,51.4783857)
654	Медногорск	Оренбургская	51.4037617	57.583163	(57.583163,51.4037617)
655	Новотроицк	Оренбургская	51.1964202	58.3018192	(58.3018192,51.1964202)
656	Оренбург	Оренбургская	51.7875092	55.1018828	(55.1018828,51.7875092)
657	Орск	Оренбургская	51.2294282	58.4752777	(58.4752777,51.2294282)
658	Соль-Илецк	Оренбургская	51.1633736	54.9896726	(54.9896726,51.1633736)
659	Сорочинск	Оренбургская	52.426685	53.1542745	(53.1542745,52.426685)
660	Ясный	Оренбургская	51.036838	59.874344	(59.874344,51.036838)
661	Болхов	Орловская	53.4438496	36.0076833	(36.0076833,53.4438496)
662	Дмитровск	Орловская	52.5054851	35.1415009	(35.1415009,52.5054851)
663	Ливны	Орловская	52.4284558	37.6039506	(37.6039506,52.4284558)
664	Малоархангельск	Орловская	52.4002192	36.5038579	(36.5038579,52.4002192)
665	Мценск	Орловская	53.2788438	36.5749105	(36.5749105,53.2788438)
666	Новосиль	Орловская	52.97454	37.0437146	(37.0437146,52.97454)
667	Орёл	Орловская	52.9671298	36.0696427	(36.0696427,52.9671298)
668	Белинский	Пензенская	52.9640996	43.4183212	(43.4183212,52.9640996)
669	Городище	Пензенская	53.2726916	45.7026142	(45.7026142,53.2726916)
670	Заречный	Пензенская	53.1960836	45.1689907	(45.1689907,53.1960836)
671	Каменка	Пензенская	53.1855463	44.0469717	(44.0469717,53.1855463)
672	Кузнецк	Пензенская	53.1130888	46.605092	(46.605092,53.1130888)
673	Нижний Ломов	Пензенская	53.5300905	43.6730217	(43.6730217,53.5300905)
674	Никольск	Пензенская	53.7137496	46.0799857	(46.0799857,53.7137496)
675	Пенза	Пензенская	53.1753314	45.0348625	(45.0348625,53.1753314)
676	Сердобск	Пензенская	52.4697595	44.2122414	(44.2122414,52.4697595)
677	Спасск	Пензенская	53.9271974	43.1859073	(43.1859073,53.9271974)
678	Сурск	Пензенская	53.0761357	45.6910796	(45.6910796,53.0761357)
679	Александровск	Пермский	59.1613221	57.5763459	(57.5763459,59.1613221)
680	Березники	Пермский	59.4079923	56.8039427	(56.8039427,59.4079923)
681	Верещагино	Пермский	58.0797571	54.6581309	(54.6581309,58.0797571)
682	Горнозаводск	Пермский	58.3742532	58.3231716	(58.3231716,58.3742532)
683	Гремячинск	Пермский	58.5626082	57.8520572	(57.8520572,58.5626082)
684	Губаха	Пермский	58.8371721	57.554533	(57.554533,58.8371721)
685	Добрянка	Пермский	58.469685	56.4130737	(56.4130737,58.469685)
686	Кизел	Пермский	59.0512783	57.6471028	(57.6471028,59.0512783)
909	Болгар	Татарстан	54.974891	49.0303882	(49.0303882,54.974891)
687	Красновишерск	Пермский	60.3901321	57.0535682	(57.0535682,60.3901321)
688	Краснокамск	Пермский	58.0822065	55.7479936	(55.7479936,58.0822065)
689	Кудымкар	Пермский	59.0167925	54.6572508	(54.6572508,59.0167925)
690	Кунгур	Пермский	57.4283296	56.9438656	(56.9438656,57.4283296)
691	Лысьва	Пермский	58.0995875	57.8086825	(57.8086825,58.0995875)
692	Нытва	Пермский	57.9336725	55.3356084	(55.3356084,57.9336725)
693	Оса	Пермский	57.2889515	55.4688668	(55.4688668,57.2889515)
694	Оханск	Пермский	57.7180034	55.3872469	(55.3872469,57.7180034)
695	Очер	Пермский	57.8852686	54.7161091	(54.7161091,57.8852686)
696	Пермь	Пермский	58.0102583	56.2342034	(56.2342034,58.0102583)
697	Соликамск	Пермский	59.6482998	56.771009	(56.771009,59.6482998)
698	Усолье	Пермский	59.4277573	56.6837872	(56.6837872,59.4277573)
699	Чайковский	Пермский	56.7781501	54.1477965	(54.1477965,56.7781501)
700	Чердынь	Пермский	60.4011933	56.4799933	(56.4799933,60.4011933)
701	Чермоз	Пермский	58.7842834	56.1507138	(56.1507138,58.7842834)
702	Чернушка	Пермский	56.5160768	56.0763049	(56.0763049,56.5160768)
703	Чусовой	Пермский	58.2974596	57.8193615	(57.8193615,58.2974596)
704	Арсеньев	Приморский	44.1622031	133.2696209	(133.2696209,44.1622031)
705	Артем	Приморский	43.3501675	132.1596175	(132.1596175,43.3501675)
706	Большой Камень	Приморский	43.1111742	132.3480082	(132.3480082,43.1111742)
707	Владивосток	Приморский	43.1164904	131.8823937	(131.8823937,43.1164904)
708	Дальнегорск	Приморский	44.5539457	135.5662716	(135.5662716,44.5539457)
709	Дальнереченск	Приморский	45.9308483	133.7316907	(133.7316907,45.9308483)
710	Лесозаводск	Приморский	45.4780092	133.4186199	(133.4186199,45.4780092)
711	Находка	Приморский	42.8239372	132.8927361	(132.8927361,42.8239372)
712	Партизанск	Приморский	43.1280578	133.1264567	(133.1264567,43.1280578)
713	Спасск-Дальний	Приморский	44.5901175	132.8157288	(132.8157288,44.5901175)
714	Уссурийск	Приморский	43.7971818	131.9518229	(131.9518229,43.7971818)
715	Фокино	Приморский	42.9706317	132.4110196	(132.4110196,42.9706317)
716	Великие Луки	Псковская	56.332208	30.5508641	(30.5508641,56.332208)
717	Гдов	Псковская	58.7432429	27.8264809	(27.8264809,58.7432429)
718	Дно	Псковская	57.826974	29.9629389	(29.9629389,57.826974)
719	Невель	Псковская	56.0201973	29.9239983	(29.9239983,56.0201973)
720	Новоржев	Псковская	57.029807	29.3433083	(29.3433083,57.029807)
721	Новосокольники	Псковская	56.3408431	30.1527573	(30.1527573,56.3408431)
722	Опочка	Псковская	56.710725	28.6717519	(28.6717519,56.710725)
723	Остров	Псковская	57.3451528	28.3437593	(28.3437593,57.3451528)
724	Печоры	Псковская	57.8145817	27.622259	(27.622259,57.8145817)
725	Порхов	Псковская	57.7765219	29.5436626	(29.5436626,57.7765219)
726	Псков	Псковская	57.8194415	28.3317198	(28.3317198,57.8194415)
727	Пустошка	Псковская	56.3374813	29.3668055	(29.3668055,56.3374813)
728	Пыталово	Псковская	57.0637952	27.9236214	(27.9236214,57.0637952)
729	Себеж	Псковская	56.2908554	28.4724326	(28.4724326,56.2908554)
730	Азов	Ростовская	47.1121589	39.4232555	(39.4232555,47.1121589)
731	Аксай	Ростовская	47.2676314	39.8756872	(39.8756872,47.2676314)
732	Батайск	Ростовская	47.1383299	39.7507179	(39.7507179,47.1383299)
733	Белая Калитва	Ростовская	48.1769737	40.8033529	(40.8033529,48.1769737)
734	Волгодонск	Ростовская	47.5165338	42.1984951	(42.1984951,47.5165338)
735	Гуково	Ростовская	48.0448904	39.9484672	(39.9484672,48.0448904)
736	Донецк	Ростовская	48.3350706	39.945891	(39.945891,48.3350706)
737	Зверево	Ростовская	48.0435487	40.1265822	(40.1265822,48.0435487)
738	Зерноград	Ростовская	46.8495958	40.312837	(40.312837,46.8495958)
739	Каменск-Шахтинский	Ростовская	48.3205326	40.2689583	(40.2689583,48.3205326)
740	Константиновск	Ростовская	47.5773717	41.0967445	(41.0967445,47.5773717)
741	Красный Сулин	Ростовская	47.8831311	40.0781298	(40.0781298,47.8831311)
742	Миллерово	Ростовская	48.9260077	40.3984087	(40.3984087,48.9260077)
743	Морозовск	Ростовская	48.3511807	41.8309225	(41.8309225,48.3511807)
744	Новочеркасск	Ростовская	47.411919	40.1042098	(40.1042098,47.411919)
745	Новошахтинск	Ростовская	47.757773	39.9363697	(39.9363697,47.757773)
746	Пролетарск	Ростовская	46.7038963	41.727594	(41.727594,46.7038963)
747	Ростов-на-Дону	Ростовская	47.2224566	39.718803	(39.718803,47.2224566)
748	Сальск	Ростовская	46.4752095	41.5410415	(41.5410415,46.4752095)
749	Семикаракорск	Ростовская	47.5177337	40.8114167	(40.8114167,47.5177337)
750	Таганрог	Ростовская	47.2094917	38.9350989	(38.9350989,47.2094917)
751	Цимлянск	Ростовская	47.6477448	42.0931505	(42.0931505,47.6477448)
752	Шахты	Ростовская	47.7085287	40.2159846	(40.2159846,47.7085287)
753	Касимов	Рязанская	54.9373475	41.3913211	(41.3913211,54.9373475)
754	Кораблино	Рязанская	53.9246659	40.0227745	(40.0227745,53.9246659)
755	Михайлов	Рязанская	54.2297402	39.0091481	(39.0091481,54.2297402)
756	Новомичуринск	Рязанская	54.0376572	39.74654	(39.74654,54.0376572)
757	Рыбное	Рязанская	54.7256164	39.5134398	(39.5134398,54.7256164)
758	Ряжск	Рязанская	53.7067584	40.0522274	(40.0522274,53.7067584)
759	Рязань	Рязанская	54.6254445	39.7358609	(39.7358609,54.6254445)
760	Сасово	Рязанская	54.3508885	41.9117422	(41.9117422,54.3508885)
761	Скопин	Рязанская	53.823543	39.5492421	(39.5492421,53.823543)
762	Спас-Клепики	Рязанская	55.1291721	40.1745338	(40.1745338,55.1291721)
1056	Грозный	Чеченская	43.3180145	45.698291	(45.698291,43.3180145)
763	Спасск-Рязанский	Рязанская	54.4070719	40.3763426	(40.3763426,54.4070719)
764	Шацк	Рязанская	54.0287312	41.7181803	(41.7181803,54.0287312)
765	Жигулевск	Самарская	53.4011981	49.4945176	(49.4945176,53.4011981)
766	Кинель	Самарская	53.2210298	50.6343776	(50.6343776,53.2210298)
767	Нефтегорск	Самарская	52.7972914	51.1637392	(51.1637392,52.7972914)
768	Новокуйбышевск	Самарская	53.0994565	49.9477382	(49.9477382,53.0994565)
769	Октябрьск	Самарская	53.1640488	48.670762	(48.670762,53.1640488)
770	Отрадный	Самарская	53.3800848	51.3438605	(51.3438605,53.3800848)
771	Похвистнево	Самарская	53.6498299	52.1235156	(52.1235156,53.6498299)
772	Самара	Самарская	53.1950306	50.1069518	(50.1069518,53.1950306)
773	Сызрань	Самарская	53.1558674	48.4744629	(48.4744629,53.1558674)
774	Тольятти	Самарская	53.5205348	49.3894028	(49.3894028,53.5205348)
775	Чапаевск	Самарская	52.928961	49.8673269	(49.8673269,52.928961)
776	Аркадак	Саратовская	51.938831	43.4999221	(43.4999221,51.938831)
777	Аткарск	Саратовская	51.8736062	45.0003247	(45.0003247,51.8736062)
778	Балаково	Саратовская	52.0224231	47.7827765	(47.7827765,52.0224231)
779	Балашов	Саратовская	51.5388697	43.1839757	(43.1839757,51.5388697)
780	Вольск	Саратовская	52.0459865	47.3873595	(47.3873595,52.0459865)
781	Ершов	Саратовская	51.3508505	48.2762226	(48.2762226,51.3508505)
782	Калининск	Саратовская	51.4993591	44.4710435	(44.4710435,51.4993591)
783	Красноармейск	Саратовская	51.023541	45.695044	(45.695044,51.023541)
784	Красный Кут	Саратовская	50.9598317	46.9712016	(46.9712016,50.9598317)
785	Маркс	Саратовская	51.7133337	46.7400339	(46.7400339,51.7133337)
786	Новоузенск	Саратовская	50.455199	48.1413153	(48.1413153,50.455199)
787	Петровск	Саратовская	52.3094237	45.3851877	(45.3851877,52.3094237)
788	Пугачев	Саратовская	52.0159921	48.7972223	(48.7972223,52.0159921)
789	Ртищево	Саратовская	52.2616271	43.7842248	(43.7842248,52.2616271)
790	Саратов	Саратовская	51.533557	46.034257	(46.034257,51.533557)
791	Хвалынск	Саратовская	52.4951572	48.1045771	(48.1045771,52.4951572)
792	Шиханы	Саратовская	52.1147391	47.2023118	(47.2023118,52.1147391)
793	Энгельс	Саратовская	51.4854003	46.126722	(46.126722,51.4854003)
794	Александровск-Сахалинский	Сахалинская	50.8974378	142.1578559	(142.1578559,50.8974378)
795	Анива	Сахалинская	46.713152	142.5265804	(142.5265804,46.713152)
796	Долинск	Сахалинская	47.3255783	142.7945071	(142.7945071,47.3255783)
797	Корсаков	Сахалинская	46.6324545	142.799445	(142.799445,46.6324545)
798	Курильск	Сахалинская	45.2270954	147.8796323	(147.8796323,45.2270954)
799	Макаров	Сахалинская	48.6236334	142.7803205	(142.7803205,48.6236334)
800	Невельск	Сахалинская	46.6526899	141.8630725	(141.8630725,46.6526899)
801	Оха	Сахалинская	53.5867839	142.9412411	(142.9412411,53.5867839)
802	Поронайск	Сахалинская	49.238866	143.1008333	(143.1008333,49.238866)
803	Северо-Курильск	Сахалинская	50.6730577	156.1282211	(156.1282211,50.6730577)
804	Томари	Сахалинская	47.7620108	142.0615837	(142.0615837,47.7620108)
805	Углегорск	Сахалинская	49.0815774	142.0692639	(142.0692639,49.0815774)
806	Холмск	Сахалинская	47.0408423	142.041688	(142.041688,47.0408423)
807	Южно-Сахалинск	Сахалинская	46.9591631	142.737976	(142.737976,46.9591631)
808	Алапаевск	Свердловская	57.8475571	61.6693817	(61.6693817,57.8475571)
809	Арамиль	Свердловская	56.694632	60.8343125	(60.8343125,56.694632)
810	Артемовский	Свердловская	57.3384177	61.8947443	(61.8947443,57.3384177)
811	Асбест	Свердловская	57.0052277	61.4581156	(61.4581156,57.0052277)
812	Березовский	Свердловская	56.9095924	60.8180907	(60.8180907,56.9095924)
813	Богданович	Свердловская	56.7764795	62.0463679	(62.0463679,56.7764795)
814	Верхний Тагил	Свердловская	57.3763758	59.9517653	(59.9517653,57.3763758)
815	Верхняя Пышма	Свердловская	56.9758903	60.5650383	(60.5650383,56.9758903)
816	Верхняя Салда	Свердловская	58.0465803	60.5560164	(60.5560164,58.0465803)
817	Верхняя Тура	Свердловская	58.3643685	59.8265235	(59.8265235,58.3643685)
818	Верхотурье	Свердловская	58.8622073	60.8103945	(60.8103945,58.8622073)
819	Волчанск	Свердловская	59.9351707	60.0798618	(60.0798618,59.9351707)
820	Дегтярск	Свердловская	56.7048206	60.079138	(60.079138,56.7048206)
821	Екатеринбург	Свердловская	56.8385216	60.6054911	(60.6054911,56.8385216)
822	Заречный	Свердловская	56.8102931	61.3380029	(61.3380029,56.8102931)
823	Ивдель	Свердловская	60.6944496	60.4245069	(60.4245069,60.6944496)
824	Ирбит	Свердловская	57.6838362	63.057675	(63.057675,57.6838362)
825	Каменск-Уральский	Свердловская	56.414962	61.9188674	(61.9188674,56.414962)
826	Камышлов	Свердловская	56.8465034	62.7119766	(62.7119766,56.8465034)
827	Карпинск	Свердловская	59.7665925	60.0011703	(60.0011703,59.7665925)
828	Качканар	Свердловская	58.7051762	59.4839155	(59.4839155,58.7051762)
829	Кировград	Свердловская	57.4299433	60.0624051	(60.0624051,57.4299433)
830	Краснотурьинск	Свердловская	59.7636635	60.1934525	(60.1934525,59.7636635)
831	Красноуральск	Свердловская	58.348651	60.0408764	(60.0408764,58.348651)
832	Красноуфимск	Свердловская	56.612387	57.7636637	(57.7636637,56.612387)
833	Кушва	Свердловская	58.2826013	59.7645766	(59.7645766,58.2826013)
834	Лесной	Свердловская	58.6348516	59.7981565	(59.7981565,58.6348516)
835	Михайловск	Свердловская	56.4370039	59.1137316	(59.1137316,56.4370039)
836	Невьянск	Свердловская	57.49131	60.2183429	(60.2183429,57.49131)
837	Нижние Серги	Свердловская	56.6544959	59.2953035	(59.2953035,56.6544959)
838	Нижний Тагил	Свердловская	57.910126	59.9812853	(59.9812853,57.910126)
839	Нижняя Салда	Свердловская	58.0748272	60.7025418	(60.7025418,58.0748272)
840	Нижняя Тура	Свердловская	58.6309267	59.8520344	(59.8520344,58.6309267)
841	Новая Ляля	Свердловская	59.0538977	60.5944825	(60.5944825,59.0538977)
842	Новоуральск	Свердловская	57.2472567	60.0956714	(60.0956714,57.2472567)
843	Первоуральск	Свердловская	56.9080085	59.942926	(59.942926,56.9080085)
844	Полевской	Свердловская	56.4956952	60.2365298	(60.2365298,56.4956952)
845	Ревда	Свердловская	56.7986319	59.9071591	(59.9071591,56.7986319)
846	Реж	Свердловская	57.3717477	61.3833842	(61.3833842,57.3717477)
847	Североуральск	Свердловская	60.1533109	59.9525245	(59.9525245,60.1533109)
848	Серов	Свердловская	59.6047724	60.5753882	(60.5753882,59.6047724)
849	Среднеуральск	Свердловская	56.9918901	60.4771018	(60.4771018,56.9918901)
850	Сухой Лог	Свердловская	56.9076193	62.0358093	(62.0358093,56.9076193)
851	Сысерть	Свердловская	56.5005715	60.8190003	(60.8190003,56.5005715)
852	Тавда	Свердловская	58.0434672	65.274217	(65.274217,58.0434672)
853	Талица	Свердловская	57.0122687	63.7320757	(63.7320757,57.0122687)
854	Туринск	Свердловская	58.0393524	63.6981973	(63.6981973,58.0393524)
855	Алагир	Северная Осетия - Алания	43.0417684	44.2199715	(44.2199715,43.0417684)
856	Ардон	Северная Осетия - Алания	43.1755152	44.2955775	(44.2955775,43.1755152)
857	Беслан	Северная Осетия - Алания	43.1937529	44.5338707	(44.5338707,43.1937529)
858	Владикавказ	Северная Осетия - Алания	43.020588	44.6819182	(44.6819182,43.020588)
859	Дигора	Северная Осетия - Алания	43.1567628	44.1549483	(44.1549483,43.1567628)
860	Моздок	Северная Осетия - Алания	43.7471342	44.6569607	(44.6569607,43.7471342)
861	Велиж	Смоленская	55.6057916	31.1856206	(31.1856206,55.6057916)
862	Вязьма	Смоленская	55.2116983	34.2951663	(34.2951663,55.2116983)
863	Гагарин	Смоленская	55.5525228	34.9950502	(34.9950502,55.5525228)
864	Демидов	Смоленская	55.2682105	31.5062809	(31.5062809,55.2682105)
865	Десногорск	Смоленская	54.146457	33.2833222	(33.2833222,54.146457)
866	Дорогобуж	Смоленская	54.9136959	33.3023162	(33.3023162,54.9136959)
867	Духовщина	Смоленская	55.1950257	32.401252	(32.401252,55.1950257)
868	Ельня	Смоленская	54.5837795	33.1749867	(33.1749867,54.5837795)
869	Починок	Смоленская	54.406244	32.4398039	(32.4398039,54.406244)
870	Рославль	Смоленская	53.9449558	32.8480258	(32.8480258,53.9449558)
871	Рудня	Смоленская	54.9441093	31.0794806	(31.0794806,54.9441093)
872	Сафоново	Смоленская	55.1199661	33.2336988	(33.2336988,55.1199661)
873	Смоленск	Смоленская	54.782635	32.045251	(32.045251,54.782635)
874	Сычевка	Смоленская	55.8308821	34.2778793	(34.2778793,55.8308821)
875	Ярцево	Смоленская	55.0564732	32.6902302	(32.6902302,55.0564732)
876	Благодарный	Ставропольский	45.0989782	43.4306455	(43.4306455,45.0989782)
877	Буденновск	Ставропольский	44.7816067	44.1650339	(44.1650339,44.7816067)
878	Георгиевск	Ставропольский	44.1485694	43.4739851	(43.4739851,44.1485694)
879	Ессентуки	Ставропольский	44.0446186	42.8588653	(42.8588653,44.0446186)
880	Железноводск	Ставропольский	44.1320568	43.0306461	(43.0306461,44.1320568)
881	Зеленокумск	Ставропольский	44.4032668	43.8841877	(43.8841877,44.4032668)
882	Изобильный	Ставропольский	45.3684296	41.708702	(41.708702,45.3684296)
883	Ипатово	Ставропольский	45.7181751	42.8970206	(42.8970206,45.7181751)
884	Кисловодск	Ставропольский	43.9052044	42.7168721	(42.7168721,43.9052044)
885	Лермонтов	Ставропольский	44.1054107	42.973135	(42.973135,44.1054107)
886	Минеральные Воды	Ставропольский	44.2087273	43.138408	(43.138408,44.2087273)
887	Михайловск	Ставропольский	45.1297323	42.0288443	(42.0288443,45.1297323)
888	Невинномысск	Ставропольский	44.6226031	41.9476723	(41.9476723,44.6226031)
889	Инза	Ульяновская	53.8549647	46.3533459	(46.3533459,53.8549647)
890	Нефтекумск	Ставропольский	44.7544552	44.9865347	(44.9865347,44.7544552)
891	Новоалександровск	Ставропольский	45.4932733	41.2153996	(41.2153996,45.4932733)
892	Новопавловск	Ставропольский	43.9617097	43.6342865	(43.6342865,43.9617097)
893	Пятигорск	Ставропольский	44.041091	43.0661553	(43.0661553,44.041091)
894	Светлоград	Ставропольский	45.328659	42.8565714	(42.8565714,45.328659)
895	Ставрополь	Ставропольский	45.044516	41.9689655	(41.9689655,45.044516)
896	Жердевка	Тамбовская	51.8422192	41.4617687	(41.4617687,51.8422192)
897	Кирсанов	Тамбовская	52.6506335	42.7286445	(42.7286445,52.6506335)
898	Котовск	Тамбовская	52.5924489	41.5101237	(41.5101237,52.5924489)
899	Мичуринск	Тамбовская	52.8912389	40.5104443	(40.5104443,52.8912389)
900	Моршанск	Тамбовская	53.4436216	41.8115478	(41.8115478,53.4436216)
901	Рассказово	Тамбовская	52.6538833	41.874285	(41.874285,52.6538833)
902	Тамбов	Тамбовская	52.7213154	41.452264	(41.452264,52.7213154)
903	Уварово	Тамбовская	51.9767841	42.2529799	(42.2529799,51.9767841)
904	Агрыз	Татарстан	56.5232864	52.9943775	(52.9943775,56.5232864)
905	Азнакаево	Татарстан	54.8598642	53.0745527	(53.0745527,54.8598642)
906	Альметьевск	Татарстан	54.9014619	52.2970467	(52.2970467,54.9014619)
907	Арск	Татарстан	56.0912567	49.877067	(49.877067,56.0912567)
910	Бугульма	Татарстан	54.5363495	52.7895849	(52.7895849,54.5363495)
911	Буинск	Татарстан	54.9641538	48.2901209	(48.2901209,54.9641538)
912	Елабуга	Татарстан	55.7567107	52.0543794	(52.0543794,55.7567107)
913	Заинск	Татарстан	55.299053	52.0062972	(52.0062972,55.299053)
914	Зеленодольск	Татарстан	55.8466651	48.5010954	(48.5010954,55.8466651)
915	Иннополис	Татарстан	55.7521699	48.7446846	(48.7446846,55.7521699)
916	Казань	Татарстан	55.7943584	49.1114975	(49.1114975,55.7943584)
917	Кукмор	Татарстан	56.1861392	50.8970238	(50.8970238,56.1861392)
918	Лаишево	Татарстан	55.4042867	49.5499838	(49.5499838,55.4042867)
919	Лениногорск	Татарстан	54.5967034	52.4431906	(52.4431906,54.5967034)
920	Мамадыш	Татарстан	55.7150413	51.4129016	(51.4129016,55.7150413)
921	Менделеевск	Татарстан	55.895169	52.3143347	(52.3143347,55.895169)
922	Мензелинск	Татарстан	55.7270698	53.1003968	(53.1003968,55.7270698)
923	Набережные Челны	Татарстан	55.7434619	52.3959165	(52.3959165,55.7434619)
924	Нижнекамск	Татарстан	55.6313609	51.8144669	(51.8144669,55.6313609)
925	Нурлат	Татарстан	54.4281461	50.8049337	(50.8049337,54.4281461)
926	Тетюши	Татарстан	54.936516	48.8314533	(48.8314533,54.936516)
927	Чистополь	Татарстан	55.3699139	50.6285784	(50.6285784,55.3699139)
928	Андреаполь	Тверская	56.6506724	32.2620163	(32.2620163,56.6506724)
929	Бежецк	Тверская	57.7860089	36.6904983	(36.6904983,57.7860089)
930	Белый	Тверская	55.8339056	32.9389741	(32.9389741,55.8339056)
931	Бологое	Тверская	57.8855767	34.0537771	(34.0537771,57.8855767)
932	Весьегонск	Тверская	58.6582598	37.2567558	(37.2567558,58.6582598)
933	Вышний Волочек	Тверская	57.568302	34.5404016	(34.5404016,57.568302)
934	Западная Двина	Тверская	56.2566492	32.0805315	(32.0805315,56.2566492)
935	Зубцов	Тверская	56.1760868	34.5825515	(34.5825515,56.1760868)
936	Калязин	Тверская	57.2579478	37.7819693	(37.7819693,57.2579478)
937	Кашин	Тверская	57.360194	37.6119436	(37.6119436,57.360194)
938	Кимры	Тверская	56.8733213	37.3556605	(37.3556605,56.8733213)
939	Конаково	Тверская	56.7275204	36.8012716	(36.8012716,56.7275204)
940	Красный Холм	Тверская	58.0571446	37.1126156	(37.1126156,58.0571446)
941	Кувшиново	Тверская	57.0265168	34.1676009	(34.1676009,57.0265168)
942	Лихославль	Тверская	57.1221304	35.4667605	(35.4667605,57.1221304)
943	Нелидово	Тверская	56.2232566	32.7767459	(32.7767459,56.2232566)
944	Осташков	Тверская	57.1456744	33.1115372	(33.1115372,57.1456744)
945	Ржев	Тверская	56.262881	34.3291002	(34.3291002,56.262881)
946	Старица	Тверская	56.514876	34.9336396	(34.9336396,56.514876)
947	Тверь	Тверская	56.8586059	35.9116761	(35.9116761,56.8586059)
948	Торжок	Тверская	57.04133	34.9602344	(34.9602344,57.04133)
949	Торопец	Тверская	56.5012188	31.6355466	(31.6355466,56.5012188)
950	Удомля	Тверская	57.8787314	35.0167348	(35.0167348,57.8787314)
951	Асино	Томская	56.9907085	86.1765257	(86.1765257,56.9907085)
952	Кедровый	Томская	57.561869	79.5677821	(79.5677821,57.561869)
953	Колпашево	Томская	58.3114253	82.9025829	(82.9025829,58.3114253)
954	Северск	Томская	56.6031285	84.8809926	(84.8809926,56.6031285)
955	Стрежевой	Томская	60.732895	77.604122	(77.604122,60.732895)
956	Томск	Томская	56.4845804	84.9481582	(84.9481582,56.4845804)
957	Алексин	Тульская	54.5083349	37.0478067	(37.0478067,54.5083349)
958	Белев	Тульская	53.8114179	36.1382247	(36.1382247,53.8114179)
959	Богородицк	Тульская	53.7701014	38.1225152	(38.1225152,53.7701014)
960	Болохово	Тульская	54.0820349	37.826724	(37.826724,54.0820349)
961	Венев	Тульская	54.3542315	38.2642236	(38.2642236,54.3542315)
962	Донской	Тульская	53.9678944	38.3371824	(38.3371824,53.9678944)
963	Ефремов	Тульская	53.1464766	38.0921657	(38.0921657,53.1464766)
964	Кимовск	Тульская	53.9698378	38.5380808	(38.5380808,53.9698378)
965	Киреевск	Тульская	53.9319555	37.9220351	(37.9220351,53.9319555)
966	Липки	Тульская	53.9417551	37.7020148	(37.7020148,53.9417551)
967	Новомосковск	Тульская	54.0109075	38.2914024	(38.2914024,54.0109075)
968	Плавск	Тульская	53.7096415	37.2862352	(37.2862352,53.7096415)
969	Советск	Тульская	53.9338874	37.6316141	(37.6316141,53.9338874)
970	Суворов	Тульская	54.1343585	36.4807419	(36.4807419,54.1343585)
971	Тула	Тульская	54.1920559	37.6153842	(37.6153842,54.1920559)
972	Узловая	Тульская	53.9730452	38.1763201	(38.1763201,53.9730452)
973	Чекалин	Тульская	54.0984438	36.2474142	(36.2474142,54.0984438)
974	Щекино	Тульская	54.0020652	37.5176288	(37.5176288,54.0020652)
975	Ясногорск	Тульская	54.4795484	37.6896048	(37.6896048,54.4795484)
976	Ак-Довурак	Тыва	51.178452	90.5985129	(90.5985129,51.178452)
977	Кызыл	Тыва	51.7191047	94.4376882	(94.4376882,51.7191047)
978	Туран	Тыва	52.1449619	93.9173396	(93.9173396,52.1449619)
979	Чадан	Тыва	51.2844502	91.5788609	(91.5788609,51.2844502)
980	Шагонар	Тыва	51.5346393	92.9199675	(92.9199675,51.5346393)
981	Заводоуковск	Тюменская	56.5027463	66.5513613	(66.5513613,56.5027463)
982	Ишим	Тюменская	56.1104858	69.4795776	(69.4795776,56.1104858)
983	Тобольск	Тюменская	58.2017299	68.2538558	(68.2538558,58.2017299)
984	Тюмень	Тюменская	57.1529744	65.5344099	(65.5344099,57.1529744)
985	Ялуторовск	Тюменская	56.6547289	66.3122992	(66.3122992,56.6547289)
986	Воткинск	Удмуртская	57.0518149	53.9873096	(53.9873096,57.0518149)
987	Глазов	Удмуртская	58.1359233	52.6635038	(52.6635038,58.1359233)
988	Ижевск	Удмуртская	56.852738	53.2114896	(53.2114896,56.852738)
989	Камбарка	Удмуртская	56.2659916	54.193374	(54.193374,56.2659916)
990	Можга	Удмуртская	56.4427774	52.2137886	(52.2137886,56.4427774)
991	Сарапул	Удмуртская	56.4615767	53.8037657	(53.8037657,56.4615767)
992	Барыш	Ульяновская	53.6533992	47.1181134	(47.1181134,53.6533992)
993	Димитровград	Ульяновская	54.2167926	49.6262585	(49.6262585,54.2167926)
994	Новоульяновск	Ульяновская	54.1447956	48.3910789	(48.3910789,54.1447956)
995	Сенгилей	Ульяновская	53.958964	48.7768269	(48.7768269,53.958964)
996	Ульяновск	Ульяновская	54.3079415	48.3748487	(48.3748487,54.3079415)
997	Амурск	Хабаровский	50.2344147	136.8792444	(136.8792444,50.2344147)
998	Бикин	Хабаровский	46.8185743	134.2550718	(134.2550718,46.8185743)
999	Вяземский	Хабаровский	47.5353379	134.7553856	(134.7553856,47.5353379)
1000	Комсомольск-на-Амуре	Хабаровский	50.5498936	137.0079408	(137.0079408,50.5498936)
1001	Николаевск-на-Амуре	Хабаровский	53.1460657	140.7111367	(140.7111367,53.1460657)
1002	Советская Гавань	Хабаровский	48.9664966	140.285174	(140.285174,48.9664966)
1003	Хабаровск	Хабаровский	48.4647258	135.0598942	(135.0598942,48.4647258)
1004	Абаза	Хакасия	52.6516647	90.0885686	(90.0885686,52.6516647)
1005	Абакан	Хакасия	53.7223325	91.4436721	(91.4436721,53.7223325)
1006	Саяногорск	Хакасия	53.1008083	91.4122454	(91.4122454,53.1008083)
1007	Сорск	Хакасия	54.0002888	90.2594446	(90.2594446,54.0002888)
1008	Черногорск	Хакасия	53.8259342	91.3260229	(91.3260229,53.8259342)
1009	Белоярский	Ханты-Мансийский Автономный округ - Югра	63.7121099	66.6772226	(66.6772226,63.7121099)
1010	Когалым	Ханты-Мансийский Автономный округ - Югра	62.2639527	74.4829794	(74.4829794,62.2639527)
1011	Лангепас	Ханты-Мансийский Автономный округ - Югра	61.2536939	75.1807763	(75.1807763,61.2536939)
1012	Лянтор	Ханты-Мансийский Автономный округ - Югра	61.6392863	72.179409	(72.179409,61.6392863)
1013	Мегион	Ханты-Мансийский Автономный округ - Югра	61.0318712	76.1025878	(76.1025878,61.0318712)
1014	Нефтеюганск	Ханты-Мансийский Автономный округ - Югра	61.0882676	72.6164079	(72.6164079,61.0882676)
1015	Нижневартовск	Ханты-Мансийский Автономный округ - Югра	60.9396698	76.5696184	(76.5696184,60.9396698)
1016	Нягань	Ханты-Мансийский Автономный округ - Югра	62.1454701	65.3946047	(65.3946047,62.1454701)
1017	Покачи	Ханты-Мансийский Автономный округ - Югра	61.7422169	75.5941517	(75.5941517,61.7422169)
1018	Пыть-Ях	Ханты-Мансийский Автономный округ - Югра	60.7585833	72.8365617	(72.8365617,60.7585833)
1019	Радужный	Ханты-Мансийский Автономный округ - Югра	62.1342888	77.4584094	(77.4584094,62.1342888)
1020	Советский	Ханты-Мансийский Автономный округ - Югра	61.3706913	63.5667222	(63.5667222,61.3706913)
1021	Сургут	Ханты-Мансийский Автономный округ - Югра	61.2541083	73.3961587	(73.3961587,61.2541083)
1022	Урай	Ханты-Мансийский Автономный округ - Югра	60.1296954	64.8038508	(64.8038508,60.1296954)
1023	Ханты-Мансийск	Ханты-Мансийский Автономный округ - Югра	61.0023984	69.0184798	(69.0184798,61.0023984)
1024	Югорск	Ханты-Мансийский Автономный округ - Югра	61.3123568	63.3365484	(63.3365484,61.3123568)
1025	Аша	Челябинская	54.9906527	57.2783953	(57.2783953,54.9906527)
1026	Бакал	Челябинская	54.9406399	58.8051698	(58.8051698,54.9406399)
1027	Верхнеуральск	Челябинская	53.8760961	59.2169852	(59.2169852,53.8760961)
1028	Верхний Уфалей	Челябинская	56.0487158	60.2318886	(60.2318886,56.0487158)
1029	Еманжелинск	Челябинская	54.7554548	61.3243477	(61.3243477,54.7554548)
1030	Златоуст	Челябинская	55.1714905	59.6725549	(59.6725549,55.1714905)
1031	Карабаш	Челябинская	55.4852323	60.2358881	(60.2358881,55.4852323)
1032	Карталы	Челябинская	53.0536197	60.6478408	(60.6478408,53.0536197)
1033	Касли	Челябинская	55.8868784	60.7421663	(60.7421663,55.8868784)
1034	Катав-Ивановск	Челябинская	54.7521438	58.1983648	(58.1983648,54.7521438)
1035	Копейск	Челябинская	55.116665	61.6179185	(61.6179185,55.116665)
1036	Коркино	Челябинская	54.8903147	61.4034576	(61.4034576,54.8903147)
1037	Куса	Челябинская	55.3386053	59.4385778	(59.4385778,55.3386053)
1038	Кыштым	Челябинская	55.7061276	60.5563781	(60.5563781,55.7061276)
1039	Магнитогорск	Челябинская	53.4072153	58.9791437	(58.9791437,53.4072153)
1040	Миасс	Челябинская	55.0456457	60.1077572	(60.1077572,55.0456457)
1041	Миньяр	Челябинская	55.0709557	57.548478	(57.548478,55.0709557)
1042	Нязепетровск	Челябинская	56.0536895	59.6097202	(59.6097202,56.0536895)
1043	Озерск	Челябинская	55.763154	60.7076198	(60.7076198,55.763154)
1044	Пласт	Челябинская	54.3692764	60.8151894	(60.8151894,54.3692764)
1045	Сатка	Челябинская	55.0405288	59.0288975	(59.0288975,55.0405288)
1046	Сим	Челябинская	54.9907827	57.6900155	(57.6900155,54.9907827)
1047	Снежинск	Челябинская	56.0851495	60.7324914	(60.7324914,56.0851495)
1048	Трехгорный	Челябинская	54.8178249	58.4464194	(58.4464194,54.8178249)
1049	Троицк	Челябинская	54.0843745	61.5586831	(61.5586831,54.0843745)
1050	Усть-Катав	Челябинская	54.9260812	58.152805	(58.152805,54.9260812)
1051	Чебаркуль	Челябинская	54.9818567	60.3773121	(60.3773121,54.9818567)
1052	Челябинск	Челябинская	55.1602624	61.4008078	(61.4008078,55.1602624)
1053	Южноуральск	Челябинская	54.448927	61.2581158	(61.2581158,54.448927)
1054	Юрюзань	Челябинская	54.854662	58.4226698	(58.4226698,54.854662)
1055	Аргун	Чеченская	43.2916774	45.8723105	(45.8723105,43.2916774)
1057	Гудермес	Чеченская	43.3519142	46.1035645	(46.1035645,43.3519142)
1058	Курчалой	Чеченская	43.2046547	46.0889364	(46.0889364,43.2046547)
1059	Шали	Чеченская	43.1488691	45.9009629	(45.9009629,43.1488691)
1060	Алатырь	Чувашская Республика	54.8397989	46.5721997	(46.5721997,54.8397989)
1061	Канаш	Чувашская Республика	55.507	47.4918273	(47.4918273,55.507)
1062	Козловка	Чувашская Республика	55.8406025	48.2577735	(48.2577735,55.8406025)
1063	Мариинский Посад	Чувашская Республика	56.111923	47.7142942	(47.7142942,56.111923)
1064	Новочебоксарск	Чувашская Республика	56.1094977	47.4791113	(47.4791113,56.1094977)
1065	Цивильск	Чувашская Республика	55.8650213	47.4729349	(47.4729349,55.8650213)
1066	Чебоксары	Чувашская Республика	56.1438298	47.2489782	(47.2489782,56.1438298)
1067	Шумерля	Чувашская Республика	55.4962415	46.4182681	(46.4182681,55.4962415)
1068	Ядрин	Чувашская Республика	55.9406974	46.2020896	(46.2020896,55.9406974)
1069	Анадырь	Чукотский	64.7313924	177.5015421	(177.5015421,64.7313924)
1070	Билибино	Чукотский	68.0584191	166.4388172	(166.4388172,68.0584191)
1071	Певек	Чукотский	69.7016661	170.2999022	(170.2999022,69.7016661)
1072	Алдан	Саха /Якутия/	58.6094283	125.3817188	(125.3817188,58.6094283)
1073	Верхоянск	Саха /Якутия/	67.5502451	133.390735	(133.390735,67.5502451)
1074	Вилюйск	Саха /Якутия/	63.7517616	121.627284	(121.627284,63.7517616)
1075	Ленск	Саха /Якутия/	60.7276196	114.9548255	(114.9548255,60.7276196)
1076	Мирный	Саха /Якутия/	62.536232	113.9667728	(113.9667728,62.536232)
1077	Нерюнгри	Саха /Якутия/	56.6599953	124.7202403	(124.7202403,56.6599953)
1078	Нюрба	Саха /Якутия/	63.2828955	118.3242437	(118.3242437,63.2828955)
1079	Олекминск	Саха /Якутия/	60.3758006	120.4060878	(120.4060878,60.3758006)
1080	Покровск	Саха /Якутия/	61.4843503	129.1482392	(129.1482392,61.4843503)
1081	Среднеколымск	Саха /Якутия/	67.4582218	153.7069425	(153.7069425,67.4582218)
1082	Томмот	Саха /Якутия/	58.9586859	126.2875462	(126.2875462,58.9586859)
1083	Удачный	Саха /Якутия/	66.4071765	112.3061555	(112.3061555,66.4071765)
1084	Якутск	Саха /Якутия/	62.0281405	129.7325887	(129.7325887,62.0281405)
1085	Губкинский	Ямало-Ненецкий	64.4457594	76.4713274	(76.4713274,64.4457594)
1086	Лабытнанги	Ямало-Ненецкий	66.6592841	66.3883009	(66.3883009,66.6592841)
1087	Муравленко	Ямало-Ненецкий	63.7940552	74.4948635	(74.4948635,63.7940552)
1088	Надым	Ямало-Ненецкий	65.5377966	72.5182736	(72.5182736,65.5377966)
1089	Новый Уренгой	Ямало-Ненецкий	66.0839433	76.6809681	(76.6809681,66.0839433)
1090	Ноябрьск	Ямало-Ненецкий	63.2018039	75.4510581	(75.4510581,63.2018039)
1091	Салехард	Ямало-Ненецкий	66.5492077	66.6085318	(66.6085318,66.5492077)
1092	Тарко-Сале	Ямало-Ненецкий	64.9118803	77.7610236	(77.7610236,64.9118803)
1093	Гаврилов-Ям	Ярославская	57.3091058	39.8546444	(39.8546444,57.3091058)
1094	Данилов	Ярославская	58.1860098	40.1795067	(40.1795067,58.1860098)
1095	Любим	Ярославская	58.3620228	40.686841	(40.686841,58.3620228)
1096	Мышкин	Ярославская	57.7881684	38.4544224	(38.4544224,57.7881684)
1097	Переславль-Залесский	Ярославская	56.7360544	38.8543617	(38.8543617,56.7360544)
1098	Пошехонье	Ярославская	58.5062879	39.1208434	(39.1208434,58.5062879)
1099	Ростов	Ярославская	57.2051315	39.4378622	(39.4378622,57.2051315)
1100	Рыбинск	Ярославская	58.0485495	38.8584119	(38.8584119,58.0485495)
1101	Тутаев	Ярославская	57.8674993	39.5369627	(39.5369627,57.8674993)
1102	Углич	Ярославская	57.5224249	38.3020044	(38.3020044,57.5224249)
1103	Ярославль	Ярославская	57.6215477	39.8977411	(39.8977411,57.6215477)
1106	Москва	г. Москва	55.7558	37.6173	(37.6173,55.7558)
1107	Санкт-Петербург	г. Санкт-Петербург	59.9343	30.3351	(30.3351,59.9343)
\.


--
-- TOC entry 4995 (class 0 OID 49366)
-- Dependencies: 226
-- Data for Name: matches; Type: TABLE DATA; Schema: public; Owner: postgres
--

COPY public.matches (id, user1_id, user2_id, matched_at) FROM stdin;
\.


--
-- TOC entry 4997 (class 0 OID 49387)
-- Dependencies: 228
-- Data for Name: messages; Type: TABLE DATA; Schema: public; Owner: postgres
--

COPY public.messages (id, match_id, sender_id, content, sent_at) FROM stdin;
\.


--
-- TOC entry 4999 (class 0 OID 49407)
-- Dependencies: 230
-- Data for Name: user_blocks; Type: TABLE DATA; Schema: public; Owner: postgres
--

COPY public.user_blocks (id, blocker_id, blocked_id, blocked_at) FROM stdin;
\.


--
-- TOC entry 4989 (class 0 OID 49313)
-- Dependencies: 220
-- Data for Name: user_data; Type: TABLE DATA; Schema: public; Owner: postgres
--

COPY public.user_data (id, email, password_hash, name, date_of_birth, description, active_video_id, is_hidden, created_at, updated_at, gender, city_id, min_age, max_age, radius_km, preferred_gender) FROM stdin;
1	test024119@example.com	$2a$10$vUhr1d./q9GjPJW.qVogfe6ymgkM1jw5KDlQoQXsrkDBZQe.cRCZu	Alice Updated	2000-01-15		\N	f	2026-05-09 02:41:20.308534+03	2026-05-09 02:41:20.741031+03	FEMALE	160	18	99	75	MALE,FEMALE
\.


--
-- TOC entry 5001 (class 0 OID 49427)
-- Dependencies: 232
-- Data for Name: user_reports; Type: TABLE DATA; Schema: public; Owner: postgres
--

COPY public.user_reports (id, reporter_id, reported_id, reason, created_at) FROM stdin;
\.


--
-- TOC entry 4993 (class 0 OID 49345)
-- Dependencies: 224
-- Data for Name: user_swipes; Type: TABLE DATA; Schema: public; Owner: postgres
--

COPY public.user_swipes (id, swiper_id, target_id, swiped_at, direction) FROM stdin;
\.


--
-- TOC entry 4991 (class 0 OID 49327)
-- Dependencies: 222
-- Data for Name: user_videos; Type: TABLE DATA; Schema: public; Owner: postgres
--

COPY public.user_videos (id, user_id, video_url, thumbnail_url, duration_sec, is_active, views_count, likes_count, created_at) FROM stdin;
\.


--
-- TOC entry 5019 (class 0 OID 0)
-- Dependencies: 233
-- Name: city_id_seq; Type: SEQUENCE SET; Schema: public; Owner: postgres
--

SELECT pg_catalog.setval('public.city_id_seq', 1107, true);


--
-- TOC entry 5020 (class 0 OID 0)
-- Dependencies: 225
-- Name: matches_id_seq; Type: SEQUENCE SET; Schema: public; Owner: postgres
--

SELECT pg_catalog.setval('public.matches_id_seq', 1, false);


--
-- TOC entry 5021 (class 0 OID 0)
-- Dependencies: 227
-- Name: messages_id_seq; Type: SEQUENCE SET; Schema: public; Owner: postgres
--

SELECT pg_catalog.setval('public.messages_id_seq', 1, false);


--
-- TOC entry 5022 (class 0 OID 0)
-- Dependencies: 229
-- Name: user_blocks_id_seq; Type: SEQUENCE SET; Schema: public; Owner: postgres
--

SELECT pg_catalog.setval('public.user_blocks_id_seq', 1, false);


--
-- TOC entry 5023 (class 0 OID 0)
-- Dependencies: 219
-- Name: user_data_id_seq; Type: SEQUENCE SET; Schema: public; Owner: postgres
--

SELECT pg_catalog.setval('public.user_data_id_seq', 1, true);


--
-- TOC entry 5024 (class 0 OID 0)
-- Dependencies: 231
-- Name: user_reports_id_seq; Type: SEQUENCE SET; Schema: public; Owner: postgres
--

SELECT pg_catalog.setval('public.user_reports_id_seq', 1, false);


--
-- TOC entry 5025 (class 0 OID 0)
-- Dependencies: 223
-- Name: user_swipes_id_seq; Type: SEQUENCE SET; Schema: public; Owner: postgres
--

SELECT pg_catalog.setval('public.user_swipes_id_seq', 1, false);


--
-- TOC entry 5026 (class 0 OID 0)
-- Dependencies: 221
-- Name: user_videos_id_seq; Type: SEQUENCE SET; Schema: public; Owner: postgres
--

SELECT pg_catalog.setval('public.user_videos_id_seq', 1, false);


--
-- TOC entry 4824 (class 2606 OID 49501)
-- Name: city city_pkey; Type: CONSTRAINT; Schema: public; Owner: postgres
--

ALTER TABLE ONLY public.city
    ADD CONSTRAINT city_pkey PRIMARY KEY (id);


--
-- TOC entry 4802 (class 2606 OID 49373)
-- Name: matches matches_pkey; Type: CONSTRAINT; Schema: public; Owner: postgres
--

ALTER TABLE ONLY public.matches
    ADD CONSTRAINT matches_pkey PRIMARY KEY (id);


--
-- TOC entry 4804 (class 2606 OID 49375)
-- Name: matches matches_user1_id_user2_id_key; Type: CONSTRAINT; Schema: public; Owner: postgres
--

ALTER TABLE ONLY public.matches
    ADD CONSTRAINT matches_user1_id_user2_id_key UNIQUE (user1_id, user2_id);


--
-- TOC entry 4810 (class 2606 OID 49395)
-- Name: messages messages_pkey; Type: CONSTRAINT; Schema: public; Owner: postgres
--

ALTER TABLE ONLY public.messages
    ADD CONSTRAINT messages_pkey PRIMARY KEY (id);


--
-- TOC entry 4814 (class 2606 OID 57805)
-- Name: user_blocks uk6kwyqs53ciqfxmlhquyq5socr; Type: CONSTRAINT; Schema: public; Owner: postgres
--

ALTER TABLE ONLY public.user_blocks
    ADD CONSTRAINT uk6kwyqs53ciqfxmlhquyq5socr UNIQUE (blocker_id, blocked_id);


--
-- TOC entry 4806 (class 2606 OID 57803)
-- Name: matches uklaifwukyn7lldm3525uats6wi; Type: CONSTRAINT; Schema: public; Owner: postgres
--

ALTER TABLE ONLY public.matches
    ADD CONSTRAINT uklaifwukyn7lldm3525uats6wi UNIQUE (user1_id, user2_id);


--
-- TOC entry 4795 (class 2606 OID 57807)
-- Name: user_swipes ukouecblxhn3afhijwogp1itllj; Type: CONSTRAINT; Schema: public; Owner: postgres
--

ALTER TABLE ONLY public.user_swipes
    ADD CONSTRAINT ukouecblxhn3afhijwogp1itllj UNIQUE (swiper_id, target_id);


--
-- TOC entry 4820 (class 2606 OID 49504)
-- Name: user_reports unique_report; Type: CONSTRAINT; Schema: public; Owner: postgres
--

ALTER TABLE ONLY public.user_reports
    ADD CONSTRAINT unique_report UNIQUE (reporter_id, reported_id);


--
-- TOC entry 4816 (class 2606 OID 49415)
-- Name: user_blocks user_blocks_blocker_id_blocked_id_key; Type: CONSTRAINT; Schema: public; Owner: postgres
--

ALTER TABLE ONLY public.user_blocks
    ADD CONSTRAINT user_blocks_blocker_id_blocked_id_key UNIQUE (blocker_id, blocked_id);


--
-- TOC entry 4818 (class 2606 OID 49413)
-- Name: user_blocks user_blocks_pkey; Type: CONSTRAINT; Schema: public; Owner: postgres
--

ALTER TABLE ONLY public.user_blocks
    ADD CONSTRAINT user_blocks_pkey PRIMARY KEY (id);


--
-- TOC entry 4785 (class 2606 OID 49325)
-- Name: user_data user_data_email_key; Type: CONSTRAINT; Schema: public; Owner: postgres
--

ALTER TABLE ONLY public.user_data
    ADD CONSTRAINT user_data_email_key UNIQUE (email);


--
-- TOC entry 4787 (class 2606 OID 49323)
-- Name: user_data user_data_pkey; Type: CONSTRAINT; Schema: public; Owner: postgres
--

ALTER TABLE ONLY public.user_data
    ADD CONSTRAINT user_data_pkey PRIMARY KEY (id);


--
-- TOC entry 4822 (class 2606 OID 49435)
-- Name: user_reports user_reports_pkey; Type: CONSTRAINT; Schema: public; Owner: postgres
--

ALTER TABLE ONLY public.user_reports
    ADD CONSTRAINT user_reports_pkey PRIMARY KEY (id);


--
-- TOC entry 4797 (class 2606 OID 49352)
-- Name: user_swipes user_swipes_pkey; Type: CONSTRAINT; Schema: public; Owner: postgres
--

ALTER TABLE ONLY public.user_swipes
    ADD CONSTRAINT user_swipes_pkey PRIMARY KEY (id);


--
-- TOC entry 4799 (class 2606 OID 49354)
-- Name: user_swipes user_swipes_swiper_id_target_id_key; Type: CONSTRAINT; Schema: public; Owner: postgres
--

ALTER TABLE ONLY public.user_swipes
    ADD CONSTRAINT user_swipes_swiper_id_target_id_key UNIQUE (swiper_id, target_id);


--
-- TOC entry 4790 (class 2606 OID 49338)
-- Name: user_videos user_videos_pkey; Type: CONSTRAINT; Schema: public; Owner: postgres
--

ALTER TABLE ONLY public.user_videos
    ADD CONSTRAINT user_videos_pkey PRIMARY KEY (id);


--
-- TOC entry 4811 (class 1259 OID 49454)
-- Name: idx_blocks_blocked; Type: INDEX; Schema: public; Owner: postgres
--

CREATE INDEX idx_blocks_blocked ON public.user_blocks USING btree (blocked_id);


--
-- TOC entry 4812 (class 1259 OID 49453)
-- Name: idx_blocks_blocker; Type: INDEX; Schema: public; Owner: postgres
--

CREATE INDEX idx_blocks_blocker ON public.user_blocks USING btree (blocker_id);


--
-- TOC entry 4825 (class 1259 OID 49642)
-- Name: idx_city_earth_point; Type: INDEX; Schema: public; Owner: postgres
--

CREATE INDEX idx_city_earth_point ON public.city USING gist (earth_point);


--
-- TOC entry 4826 (class 1259 OID 49525)
-- Name: idx_city_lat; Type: INDEX; Schema: public; Owner: postgres
--

CREATE INDEX idx_city_lat ON public.city USING btree (latitude);


--
-- TOC entry 4827 (class 1259 OID 49526)
-- Name: idx_city_lon; Type: INDEX; Schema: public; Owner: postgres
--

CREATE INDEX idx_city_lon ON public.city USING btree (longitude);


--
-- TOC entry 4828 (class 1259 OID 57737)
-- Name: idx_city_name_region; Type: INDEX; Schema: public; Owner: postgres
--

CREATE INDEX idx_city_name_region ON public.city USING btree (city, region);


--
-- TOC entry 4800 (class 1259 OID 49451)
-- Name: idx_matches_users; Type: INDEX; Schema: public; Owner: postgres
--

CREATE INDEX idx_matches_users ON public.matches USING btree (user1_id, user2_id);


--
-- TOC entry 4807 (class 1259 OID 49506)
-- Name: idx_messages_match; Type: INDEX; Schema: public; Owner: postgres
--

CREATE INDEX idx_messages_match ON public.messages USING btree (match_id);


--
-- TOC entry 4808 (class 1259 OID 49452)
-- Name: idx_messages_match_time; Type: INDEX; Schema: public; Owner: postgres
--

CREATE INDEX idx_messages_match_time ON public.messages USING btree (match_id, sent_at);


--
-- TOC entry 4791 (class 1259 OID 49449)
-- Name: idx_swipes_swiper_target; Type: INDEX; Schema: public; Owner: postgres
--

CREATE INDEX idx_swipes_swiper_target ON public.user_swipes USING btree (swiper_id, target_id);


--
-- TOC entry 4792 (class 1259 OID 49450)
-- Name: idx_swipes_target; Type: INDEX; Schema: public; Owner: postgres
--

CREATE INDEX idx_swipes_target ON public.user_swipes USING btree (target_id);


--
-- TOC entry 4793 (class 1259 OID 57819)
-- Name: idx_swipes_target_dir_time; Type: INDEX; Schema: public; Owner: postgres
--

CREATE INDEX idx_swipes_target_dir_time ON public.user_swipes USING btree (target_id, direction, swiped_at);


--
-- TOC entry 4781 (class 1259 OID 49527)
-- Name: idx_user_city; Type: INDEX; Schema: public; Owner: postgres
--

CREATE INDEX idx_user_city ON public.user_data USING btree (city_id);


--
-- TOC entry 4782 (class 1259 OID 49447)
-- Name: idx_user_dob; Type: INDEX; Schema: public; Owner: postgres
--

CREATE INDEX idx_user_dob ON public.user_data USING btree (date_of_birth);


--
-- TOC entry 4783 (class 1259 OID 49446)
-- Name: idx_user_email; Type: INDEX; Schema: public; Owner: postgres
--

CREATE INDEX idx_user_email ON public.user_data USING btree (email);


--
-- TOC entry 4788 (class 1259 OID 49481)
-- Name: idx_user_videos_user_id; Type: INDEX; Schema: public; Owner: postgres
--

CREATE INDEX idx_user_videos_user_id ON public.user_videos USING btree (user_id);


--
-- TOC entry 4829 (class 2606 OID 49528)
-- Name: user_data fk_active_video; Type: FK CONSTRAINT; Schema: public; Owner: postgres
--

ALTER TABLE ONLY public.user_data
    ADD CONSTRAINT fk_active_video FOREIGN KEY (active_video_id) REFERENCES public.user_videos(id) ON DELETE SET NULL;


--
-- TOC entry 4830 (class 2606 OID 49520)
-- Name: user_data fk_user_city; Type: FK CONSTRAINT; Schema: public; Owner: postgres
--

ALTER TABLE ONLY public.user_data
    ADD CONSTRAINT fk_user_city FOREIGN KEY (city_id) REFERENCES public.city(id);


--
-- TOC entry 4834 (class 2606 OID 49376)
-- Name: matches matches_user1_id_fkey; Type: FK CONSTRAINT; Schema: public; Owner: postgres
--

ALTER TABLE ONLY public.matches
    ADD CONSTRAINT matches_user1_id_fkey FOREIGN KEY (user1_id) REFERENCES public.user_data(id);


--
-- TOC entry 4835 (class 2606 OID 49381)
-- Name: matches matches_user2_id_fkey; Type: FK CONSTRAINT; Schema: public; Owner: postgres
--

ALTER TABLE ONLY public.matches
    ADD CONSTRAINT matches_user2_id_fkey FOREIGN KEY (user2_id) REFERENCES public.user_data(id);


--
-- TOC entry 4836 (class 2606 OID 49396)
-- Name: messages messages_match_id_fkey; Type: FK CONSTRAINT; Schema: public; Owner: postgres
--

ALTER TABLE ONLY public.messages
    ADD CONSTRAINT messages_match_id_fkey FOREIGN KEY (match_id) REFERENCES public.matches(id);


--
-- TOC entry 4837 (class 2606 OID 49513)
-- Name: messages messages_match_id_fkey1; Type: FK CONSTRAINT; Schema: public; Owner: postgres
--

ALTER TABLE ONLY public.messages
    ADD CONSTRAINT messages_match_id_fkey1 FOREIGN KEY (match_id) REFERENCES public.matches(id);


--
-- TOC entry 4838 (class 2606 OID 49401)
-- Name: messages messages_sender_id_fkey; Type: FK CONSTRAINT; Schema: public; Owner: postgres
--

ALTER TABLE ONLY public.messages
    ADD CONSTRAINT messages_sender_id_fkey FOREIGN KEY (sender_id) REFERENCES public.user_data(id);


--
-- TOC entry 4839 (class 2606 OID 49421)
-- Name: user_blocks user_blocks_blocked_id_fkey; Type: FK CONSTRAINT; Schema: public; Owner: postgres
--

ALTER TABLE ONLY public.user_blocks
    ADD CONSTRAINT user_blocks_blocked_id_fkey FOREIGN KEY (blocked_id) REFERENCES public.user_data(id);


--
-- TOC entry 4840 (class 2606 OID 49416)
-- Name: user_blocks user_blocks_blocker_id_fkey; Type: FK CONSTRAINT; Schema: public; Owner: postgres
--

ALTER TABLE ONLY public.user_blocks
    ADD CONSTRAINT user_blocks_blocker_id_fkey FOREIGN KEY (blocker_id) REFERENCES public.user_data(id);


--
-- TOC entry 4841 (class 2606 OID 49441)
-- Name: user_reports user_reports_reported_id_fkey; Type: FK CONSTRAINT; Schema: public; Owner: postgres
--

ALTER TABLE ONLY public.user_reports
    ADD CONSTRAINT user_reports_reported_id_fkey FOREIGN KEY (reported_id) REFERENCES public.user_data(id);


--
-- TOC entry 4842 (class 2606 OID 49436)
-- Name: user_reports user_reports_reporter_id_fkey; Type: FK CONSTRAINT; Schema: public; Owner: postgres
--

ALTER TABLE ONLY public.user_reports
    ADD CONSTRAINT user_reports_reporter_id_fkey FOREIGN KEY (reporter_id) REFERENCES public.user_data(id);


--
-- TOC entry 4832 (class 2606 OID 49355)
-- Name: user_swipes user_swipes_swiper_id_fkey; Type: FK CONSTRAINT; Schema: public; Owner: postgres
--

ALTER TABLE ONLY public.user_swipes
    ADD CONSTRAINT user_swipes_swiper_id_fkey FOREIGN KEY (swiper_id) REFERENCES public.user_data(id);


--
-- TOC entry 4833 (class 2606 OID 49360)
-- Name: user_swipes user_swipes_target_id_fkey; Type: FK CONSTRAINT; Schema: public; Owner: postgres
--

ALTER TABLE ONLY public.user_swipes
    ADD CONSTRAINT user_swipes_target_id_fkey FOREIGN KEY (target_id) REFERENCES public.user_data(id);


--
-- TOC entry 4831 (class 2606 OID 49508)
-- Name: user_videos user_videos_user_id_fkey1; Type: FK CONSTRAINT; Schema: public; Owner: postgres
--

ALTER TABLE ONLY public.user_videos
    ADD CONSTRAINT user_videos_user_id_fkey1 FOREIGN KEY (user_id) REFERENCES public.user_data(id) ON DELETE CASCADE;


-- Completed on 2026-05-18 23:36:43

--
-- PostgreSQL database dump complete
--

